{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "b": 4,
      "c": 5,
      "d": 6,
      "e": 7,
      "f": 8,
      "g": 9,
      "h": 10,
      "i": 11,
      "j": 12,
      "k": 13,
      "l": 14,
      "m": 15,
      "n": 16,
      "bb": 17,
      "cc": 18,
      "bbbb": 19,
      "dd": 20,
      "ee": 21,
      "bbbbbbbb": 22,
      "cccc": 23,
      "ff": 24,
      "kk": 25,
      "gg": 26,
      "jj": 27,
      "hh": 28,
      "ii": 29,
      "bbbbbbbbbbbbbbbb": 30,
      "fe": 31,
      "cccccccc": 32,
      "ll": 33,
      "bc": 34,
      "de": 35,
      "fg": 36,
      "dc": 37,
      "hg": 38,
      "hi": 39,
      "ji": 40,
      "bbb": 41,
      "dddd": 42,
      "jk": 43,
      "ccc": 44,
      "kkkk": 45,
      "fee": 46,
      "ge": 47,
      "fd": 48,
      "fh": 49,
      "cccccccccccccccc": 50,
      "bbc": 51,
      "eee": 52,
      "gh": 53,
      "fc": 54,
      "gi": 55,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 56,
      "lk": 57,
      "jh": 58,
      "fi": 59,
      "db": 60,
      "fgg": 61,
      "dee": 62,
      "ffe": 63,
      "dg": 64,
      "ki": 65,
      "dde": 66,
      "cb": 67,
      "llll": 68,
      "dcc": 69,
      "jjjj": 70,
      "he": 71,
      "jii": 72,
      "be": 73,
      "jkk": 74,
      "ffff": 75,
      "bcc": 76,
      "nn": 77,
      "jg": 78,
      "ce": 79,
      "eeee": 80,
      "bbbc": 81,
      "mm": 82,
      "bbbbbbbbbbbb": 83,
      "ih": 84,
      "ddc": 85,
      "df": 86,
      "hgg": 87,
      "ffg": 88,
      "ig": 89,
      "kl": 90,
      "ddd": 91,
      "jl": 92,
      "eg": 93,
      "kjj": 94,
      "bbbbb": 95,
      "ggg": 96,
      "hhi": 97,
      "iii": 98,
      "bd": 99,
      "bbbbbb": 100,
      "cccccccccccccccccccccccccccccccc": 101,
      "kkkkkkkk": 102,
      "fdd": 103,
      "ccccc": 104,
      "hhg": 105,
      "jji": 106,
      "ec": 107,
      "fde": 108,
      "kj": 109,
      "ed": 110,
      "fb": 111,
      "kh": 112,
      "bcb": 113,
      "bbcc": 114,
      "hhh": 115,
      "dh": 116,
      "fge": 117,
      "bbbbbbb": 118,
      "fhg": 119,
      "lkk": 120,
      "gggg": 121,
      "cccccc": 122,
      "feg": 123,
      "cd": 124,
      "ddde": 125,
      "jhi": 126,
      "kjk": 127,
      "kg": 128,
      "fhh": 129,
      "dce": 130,
      "feee": 131,
      "fj": 132,
      "fcc": 133,
      "lm": 134,
      "hii": 135,
      "di": 136,
      "hhhh": 137,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 138,
      "dfe": 139,
      "ffee": 140,
      "dccc": 141,
      "bbe": 142,
      "dddddddd": 143,
      "bccc": 144,
      "hj": 145,
      "ddee": 146,
      "bbbbc": 147,
      "gc": 148,
      "li": 149,
      "dddc": 150,
      "kll": 151,
      "ccccccc": 152,
      "jki": 153,
      "hgi": 154,
      "fdc": 155,
      "kji": 156,
      "ddcc": 157,
      "dff": 158,
      "je": 159,
      "jhh": 160,
      "llllllll": 161,
      "fffg": 162,
      "dbb": 163,
      "nnnn": 164,
      "hig": 165,
      "bg": 166,
      "fffe": 167,
      "klk": 168,
      "gge": 169,
      "kii": 170,
      "fgh": 171,
      "fii": 172,
      "ggh": 173,
      "dcb": 174,
      "dbc": 175,
      "jjkk": 176,
      "deee": 177,
      "fhi": 178,
      "fgi": 179,
      "ddg": 180,
      "bbbbbc": 181,
      "ggi": 182,
      "cg": 183,
      "ccb": 184,
      "iiii": 185,
      "bbbbbbbbbb": 186,
      "dede": 187,
      "jih": 188,
      "bcbc": 189,
      "hge": 190,
      "hgh": 191,
      "bbbbbbbbbbb": 192,
      "eeg": 193,
      "ffgg": 194,
      "hih": 195,
      "ddb": 196,
      "ffh": 197,
      "fec": 198,
      "kkkkkk": 199,
      "eh": 200,
      "ei": 201,
      "bbbbbbbbb": 202,
      "jig": 203,
      "dec": 204,
      "fefe": 205,
      "fbb": 206,
      "km": 207,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbb": 208,
      "bbbcc": 209,
      "feeee": 210,
      "eb": 211,
      "jkjj": 212,
      "cbb": 213,
      "deg": 214,
      "geg": 215,
      "ffi": 216,
      "jhg": 217,
      "dcd": 218,
      "jll": 219,
      "fggg": 220,
      "bbbbbbc": 221,
      "ffc": 222,
      "fdg": 223,
      "jijj": 224,
      "nm": 225,
      "bcbb": 226,
      "dfg": 227,
      "jlk": 228,
      "iih": 229,
      "eec": 230,
      "bce": 231,
      "dgg": 232,
      "fdddd": 233,
      "bcccc": 234,
      "jgi": 235,
      "jjh": 236,
      "kjkk": 237,
      "cce": 238,
      "bbbbbbbc": 239,
      "dcccc": 240,
      "fdee": 241,
      "jgg": 242,
      "bbcb": 243,
      "hc": 244,
      "jiii": 245,
      "fk": 246,
      "dcdc": 247,
      "fccc": 248,
      "hghh": 249,
      "fhe": 250,
      "fig": 251,
      "deeee": 252,
      "bbccc": 253,
      "jm": 254,
      "lmm": 255,
      "fdde": 256,
      "iig": 257,
      "fce": 258,
      "feff": 259,
      "ie": 260,
      "gig": 261,
      "klkk": 262,
      "lh": 263,
      "fed": 264,
      "fgfg": 265,
      "dddde": 266,
      "jjg": 267,
      "cccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccc": 268,
      "kki": 269,
      "jgh": 270,
      "jiji": 271,
      "hihh": 272,
      "dge": 273,
      "dbe": 274,
      "dfc": 275,
      "fbc": 276,
      "jkkkk": 277,
      "feh": 278,
      "bbbe": 279,
      "jjjjjjjj": 280,
      "fgff": 281,
      "ke": 282,
      "llkk": 283,
      "kjh": 284,
      "jjii": 285,
      "kkkkkkkkkkkkkkkk": 286,
      "cbc": 287,
      "ddh": 288,
      "bee": 289,
      "dfd": 290,
      "dddee": 291,
      "jjji": 292,
      "bbd": 293,
      "hhgg": 294,
      "fede": 295,
      "gih": 296,
      "gee": 297,
      "fgee": 298,
      "ghe": 299,
      "bdc": 300,
      "cccccccccccccccccccccccc": 301,
      "hhe": 302,
      "eeeeee": 303,
      "bbbbbbbbbbbbbbbbbbbbbbbb": 304,
      "ljj": 305,
      "ljk": 306,
      "dbcc": 307,
      "bcccccccc": 308,
      "dcdd": 309,
      "ghgg": 310,
      "kjjjj": 311,
      "fih": 312,
      "dfee": 313,
      "lg": 314,
      "dbbb": 315,
      "cbcc": 316,
      "jf": 317,
      "fedd": 318,
      "khi": 319,
      "dedd": 320,
      "bbbbbbbbbbbbbb": 321,
      "cee": 322,
      "fbe": 323,
      "khh": 324,
      "jkh": 325,
      "lllk": 326,
      "dcg": 327,
      "dddddd": 328,
      "llm": 329,
      "bh": 330,
      "jc": 331,
      "dbbc": 332,
      "gff": 333,
      "jhii": 334,
      "mmmm": 335,
      "hhii": 336,
      "hhhi": 337,
      "nnnnnnnn": 338,
      "lkkkk": 339,
      "lki": 340,
      "bde": 341,
      "hghg": 342,
      "bbg": 343,
      "bbbbcc": 344,
      "jjjk": 345,
      "cccb": 346,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 347,
      "cdd": 348,
      "kih": 349,
      "ffffe": 350,
      "dcde": 351,
      "fcb": 352,
      "ffeee": 353,
      "fei": 354,
      "heg": 355,
      "ch": 356,
      "feeg": 357,
      "bbbbbbbbbbbbb": 358,
      "fhgg": 359,
      "dcce": 360,
      "hggg": 361,
      "bbcccc": 362,
      "feb": 363,
      "fjj": 364,
      "fefg": 365,
      "jkji": 366,
      "hhhg": 367,
      "ffge": 368,
      "ffeg": 369,
      "fdcc": 370,
      "bbcbc": 371,
      "bbbbbbbbbbbbbbb": 372,
      "jlkk": 373,
      "cdc": 374,
      "deh": 375,
      "fgggg": 376,
      "dbbbb": 377,
      "ddccc": 378,
      "jli": 379,
      "lj": 380,
      "kig": 381,
      "cbe": 382,
      "mmm": 383,
      "cde": 384,
      "dj": 385,
      "kjii": 386,
      "dddg": 387,
      "ddce": 388,
      "cccccccccccc": 389,
      "eeeee": 390,
      "hihi": 391,
      "jkjk": 392,
      "fgge": 393,
      "fffee": 394,
      "fji": 395,
      "dei": 396,
      "fgfe": 397,
      "jkki": 398,
      "gb": 399,
      "dcbc": 400,
      "dgh": 401,
      "fefee": 402,
      "ccce": 403,
      "jge": 404,
      "lji": 405,
      "ffd": 406,
      "fghg": 407,
      "ffffg": 408,
      "cbbb": 409,
      "bdd": 410,
      "fddc": 411,
      "kjji": 412,
      "fbbb": 413,
      "eede": 414,
      "fffh": 415,
      "jjjji": 416,
      "khg": 417,
      "kllll": 418,
      "kkjj": 419,
      "kjg": 420,
      "jihh": 421,
      "jkii": 422,
      "eeeg": 423,
      "hd": 424,
      "bbbbbe": 425,
      "fghh": 426,
      "fjh": 427,
      "fddd": 428,
      "fie": 429,
      "kgg": 430,
      "dedc": 431,
      "dedee": 432,
      "ddddc": 433,
      "kli": 434,
      "llllllllllllllll": 435,
      "fffgg": 436,
      "fege": 437,
      "bcbcc": 438,
      "eeeeeeee": 439,
      "jd": 440,
      "bcbbc": 441,
      "fcg": 442,
      "dccb": 443,
      "ccg": 444,
      "bbbbbbbbc": 445,
      "ccccb": 446,
      "fegg": 447,
      "fgc": 448,
      "ffffffff": 449,
      "cccccccccc": 450,
      "bcbbb": 451,
      "fjg": 452,
      "ln": 453,
      "ihii": 454,
      "hee": 455,
      "ddi": 456,
      "ddeee": 457,
      "gie": 458,
      "gf": 459,
      "defe": 460,
      "hie": 461,
      "dcbb": 462,
      "feeeee": 463,
      "kkh": 464,
      "bi": 465,
      "ccccccccccc": 466,
      "dhg": 467,
      "ddcb": 468,
      "bbbbe": 469,
      "bbbbbcc": 470,
      "dcdddd": 471,
      "nnm": 472,
      "dfde": 473,
      "ci": 474,
      "dddcc": 475,
      "dhh": 476,
      "ggfg": 477,
      "jihi": 478,
      "ffcc": 479,
      "jjki": 480,
      "fdb": 481,
      "fjk": 482,
      "ffde": 483,
      "jjj": 484,
      "dedddd": 485,
      "bf": 486,
      "dffe": 487,
      "ccbb": 488,
      "ddfe": 489,
      "bbbbbbbbbc": 490,
      "gghh": 491,
      "fdh": 492,
      "dfh": 493,
      "hgii": 494,
      "bbbccc": 495,
      "fl": 496,
      "fkk": 497,
      "jjih": 498,
      "bbbbbbbbbbbbbbbbbbb": 499,
      "jkl": 500,
      "nnn": 501,
      "hb": 502,
      "bbbbbbbbbbbc": 503,
      "hghi": 504,
      "fcccc": 505,
      "ffb": 506,
      "bbcbb": 507,
      "deeeee": 508,
      "hgggg": 509,
      "dccccc": 510,
      "jfg": 511,
      "eei": 512,
      "iihi": 513,
      "ddeg": 514,
      "klm": 515,
      "dfi": 516,
      "gd": 517,
      "eeh": 518,
      "jikk": 519,
      "lklk": 520,
      "jhe": 521,
      "fggh": 522,
      "ffgh": 523,
      "dcee": 524,
      "bbce": 525,
      "fhhg": 526,
      "kjl": 527,
      "ccbc": 528,
      "iiji": 529,
      "jkg": 530,
      "gei": 531,
      "dhe": 532,
      "dddb": 533,
      "bbbbbbbbbbc": 534,
      "ccccccccc": 535,
      "lli": 536,
      "fdfe": 537,
      "llllll": 538,
      "jiig": 539,
      "kjjkk": 540,
      "bbbbbbbbbbbbbbbbbbbb": 541,
      "dedde": 542,
      "dcdcc": 543,
      "lii": 544,
      "hhgh": 545,
      "kgi": 546,
      "cccccb": 547,
      "ffhg": 548,
      "hhih": 549,
      "iijj": 550,
      "ccccccccccccccc": 551,
      "gec": 552,
      "bbbcb": 553,
      "dgi": 554,
      "hjj": 555,
      "ij": 556,
      "ljkk": 557,
      "fffd": 558,
      "bbbbbbbbbbbbbbbbbbbbbb": 559,
      "decc": 560,
      "dcddc": 561,
      "dddddde": 562,
      "jkjkk": 563,
      "bbcbbc": 564,
      "jjjjjj": 565,
      "bccb": 566,
      "ef": 567,
      "kgh": 568,
      "fecc": 569,
      "bcg": 570,
      "jhgg": 571,
      "eeb": 572,
      "kkki": 573,
      "hgfg": 574,
      "fggi": 575,
      "jiiii": 576,
      "ceg": 577,
      "eeeeeee": 578,
      "bbccb": 579,
      "le": 580,
      "ffhh": 581,
      "feffe": 582,
      "hei": 583,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 584,
      "ddbb": 585,
      "ddbc": 586,
      "fgfh": 587,
      "geh": 588,
      "hggi": 589,
      "bcbccc": 590,
      "hk": 591,
      "mi": 592,
      "fedee": 593,
      "ccccccccccccc": 594,
      "hiji": 595,
      "jhji": 596,
      "kkkkkkkkkk": 597,
      "kjki": 598,
      "cbbbb": 599,
      "dcdb": 600,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 601,
      "hgff": 602,
      "hijj": 603,
      "beg": 604,
      "hhhii": 605,
      "fhhi": 606,
      "bbbbcb": 607,
      "ffdd": 608,
      "fffc": 609,
      "hhgi": 610,
      "gede": 611,
      "bdb": 612,
      "kn": 613,
      "bbbbbbbbbbbbbbbbbb": 614,
      "bbbd": 615,
      "bbbg": 616,
      "ddddde": 617,
      "jkll": 618,
      "bec": 619,
      "jee": 620,
      "jfh": 621,
      "mll": 622,
      "bbbbbbbbbbbbbbbbb": 623,
      "bbbbbbbbbbbbbbbbbbbbb": 624,
      "hihg": 625,
      "jklk": 626,
      "fdi": 627,
      "bbbcbb": 628,
      "fbbbb": 629,
      "fbd": 630,
      "hff": 631,
      "jhhi": 632,
      "kiii": 633,
      "bbee": 634,
      "ddfg": 635,
      "jjjii": 636,
      "bbbbbbbbbbbbbbbbbbbbbbb": 637,
      "bcd": 638,
      "jie": 639,
      "fdeee": 640,
      "lkll": 641,
      "dgee": 642,
      "bfe": 643,
      "cgg": 644,
      "dcbcc": 645,
      "klkkkk": 646,
      "kjkkkk": 647,
      "mn": 648,
      "jjjkk": 649,
      "higi": 650,
      "bbbcccc": 651,
      "cccbc": 652,
      "fcbb": 653,
      "ihgg": 654,
      "fki": 655,
      "jff": 656,
      "ggff": 657,
      "gghg": 658,
      "ded": 659,
      "dddddc": 660,
      "fhee": 661,
      "fhhh": 662,
      "hkk": 663,
      "hfg": 664,
      "jfi": 665,
      "fece": 666,
      "dfcc": 667,
      "cccccccccccccccccccccccccccccccccccccccccccccccc": 668,
      "cbbc": 669,
      "kd": 670,
      "ljh": 671,
      "ddeeee": 672,
      "higg": 673,
      "feefe": 674,
      "feeeeee": 675,
      "fhff": 676,
      "dbd": 677,
      "kijj": 678,
      "ecc": 679,
      "hji": 680,
      "hhig": 681,
      "iie": 682,
      "feffff": 683,
      "fhii": 684,
      "ffeff": 685,
      "bccbc": 686,
      "gggfg": 687,
      "fddee": 688,
      "fhgi": 689,
      "ml": 690,
      "bbdb": 691,
      "bbbbd": 692,
      "fgb": 693,
      "jkjh": 694,
      "feede": 695,
      "eeede": 696,
      "bbbcbc": 697,
      "dfb": 698,
      "ffgee": 699,
      "hf": 700,
      "jhhg": 701,
      "ddcccc": 702,
      "ddff": 703,
      "fegh": 704,
      "fgii": 705,
      "dci": 706,
      "ddddddd": 707,
      "fhfg": 708,
      "dbg": 709,
      "cec": 710,
      "bcccccc": 711,
      "dfgg": 712,
      "kc": 713,
      "hikk": 714,
      "jijh": 715,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 716,
      "lkl": 717,
      "deec": 718,
      "cbccc": 719,
      "ffffff": 720,
      "fdeg": 721,
      "bccccc": 722,
      "dhi": 723,
      "egg": 724,
      "jeg": 725,
      "jkkkkkk": 726,
      "fehg": 727,
      "fefc": 728,
      "dch": 729,
      "fdff": 730,
      "gigg": 731,
      "kikk": 732,
      "jiih": 733,
      "bbbbbbcc": 734,
      "nnnnnnnnnnnnnnnn": 735,
      "efg": 736,
      "jhgi": 737,
      "dddf": 738,
      "jjk": 739,
      "bcbbbb": 740,
      "deb": 741,
      "geff": 742,
      "bbcbbb": 743,
      "deeg": 744,
      "dgc": 745,
      "beb": 746,
      "bccbb": 747,
      "jhig": 748,
      "kllkk": 749,
      "fdce": 750,
      "mkk": 751,
      "ggc": 752,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbb": 753,
      "dcdde": 754,
      "jijk": 755,
      "gggggg": 756,
      "khe": 757,
      "ccd": 758,
      "jje": 759,
      "bbbbbbbbbbbbbbbbbbbbbbbbbb": 760,
      "deff": 761,
      "feeeg": 762,
      "gihh": 763,
      "dccbb": 764,
      "heh": 765,
      "hhihh": 766,
      "cf": 767,
      "jkkkkkkkk": 768,
      "iihh": 769,
      "fedde": 770,
      "lllkk": 771,
      "bcee": 772,
      "high": 773,
      "ddddddc": 774,
      "lkh": 775,
      "fihg": 776,
      "ffefe": 777,
      "bff": 778,
      "jjl": 779,
      "dedg": 780,
      "dece": 781,
      "dcbbb": 782,
      "cccg": 783,
      "ghii": 784,
      "gihg": 785,
      "figg": 786,
      "cbg": 787,
      "dddh": 788,
      "dcccccccc": 789,
      "dcccccc": 790,
      "jhhh": 791,
      "ccdc": 792,
      "eebb": 793,
      "eeff": 794,
      "cccce": 795,
      "ffce": 796,
      "fedg": 797,
      "lllm": 798,
      "feec": 799,
      "gefg": 800,
      "jhjj": 801,
      "kiji": 802,
      "dccg": 803,
      "fddg": 804,
      "fbg": 805,
      "lkkkkkk": 806,
      "bbi": 807,
      "cci": 808,
      "iiih": 809,
      "fecb": 810,
      "bcbbbc": 811,
      "fgfgg": 812,
      "jigg": 813,
      "jkih": 814,
      "bcce": 815,
      "kjjh": 816,
      "ggghh": 817,
      "hhihi": 818,
      "jjijj": 819,
      "dbbbbbb": 820,
      "bbbbccc": 821,
      "jjhh": 822,
      "feefee": 823,
      "ghfg": 824,
      "fihh": 825,
      "ddec": 826,
      "hec": 827,
      "fffffg": 828,
      "ddcdc": 829,
      "hggh": 830,
      "bdbb": 831,
      "fhge": 832,
      "dbbbc": 833,
      "dig": 834,
      "dbbbbb": 835,
      "fiii": 836,
      "nmm": 837,
      "ddgg": 838,
      "eegg": 839,
      "fefd": 840,
      "bcdc": 841,
      "bcbbbbbb": 842,
      "fch": 843,
      "fcee": 844,
      "bccbbc": 845,
      "jghh": 846,
      "jlm": 847,
      "ggghg": 848,
      "fje": 849,
      "dk": 850,
      "dii": 851,
      "fhig": 852,
      "ikk": 853,
      "jfe": 854,
      "ddbe": 855,
      "ffgi": 856,
      "ffeeee": 857,
      "fgcc": 858,
      "dcdg": 859,
      "ddddee": 860,
      "jkjjjj": 861,
      "jklkk": 862,
      "fhc": 863,
      "jgii": 864,
      "dfdd": 865,
      "ffgfg": 866,
      "dddccc": 867,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 868,
      "bge": 869,
      "fbcc": 870,
      "ghh": 871,
      "jb": 872,
      "jde": 873,
      "mlk": 874,
      "ddge": 875,
      "jjig": 876,
      "jjkjj": 877,
      "fefh": 878,
      "hijh": 879,
      "deede": 880,
      "ffffgg": 881,
      "bbbbbbbbbbbbbbbc": 882,
      "cdb": 883,
      "kff": 884,
      "fehh": 885,
      "fgffe": 886,
      "hgee": 887,
      "hgig": 888,
      "jijkk": 889,
      "fhfe": 890,
      "cccccccccccccccccccc": 891,
      "ccccccccccccccccccc": 892,
      "eeedee": 893,
      "ffec": 894,
      "hgge": 895,
      "gggfgg": 896,
      "khii": 897,
      "bcbcccc": 898,
      "hiih": 899,
      "ic": 900,
      "jllll": 901,
      "khhi": 902,
      "bbdc": 903,
      "fff": 904,
      "jjhi": 905,
      "fefi": 906,
      "cccccccccccccc": 907,
      "gegg": 908,
      "fdbc": 909,
      "dbccc": 910,
      "ddede": 911,
      "dccbc": 912,
      "jiiji": 913,
      "bbbbbbbbbbbbbc": 914,
      "fiig": 915,
      "dccccccc": 916,
      "gcc": 917,
      "kmm": 918,
      "cch": 919,
      "kkkjj": 920,
      "hhfg": 921,
      "fef": 922,
      "llkll": 923,
      "fgih": 924,
      "jihg": 925,
      "ddddcc": 926,
      "dddddddc": 927,
      "fcde": 928,
      "lkjj": 929,
      "dccdc": 930,
      "jkkjj": 931,
      "bbbbbbbbbbbbc": 932,
      "ffgfe": 933,
      "gggggggg": 934,
      "fcce": 935,
      "hhhhhh": 936,
      "bcccb": 937,
      "ddcce": 938,
      "dbcb": 939,
      "ni": 940,
      "nl": 941,
      "bbh": 942,
      "ccccce": 943,
      "lll": 944,
      "fghi": 945,
      "ddddg": 946,
      "ddddddde": 947,
      "jkm": 948,
      "cccbb": 949,
      "feedee": 950,
      "fdgg": 951,
      "jiijj": 952,
      "nnnm": 953,
      "cei": 954,
      "bbbce": 955,
      "ddcg": 956,
      "ffgff": 957,
      "dddeee": 958,
      "fddde": 959,
      "kje": 960,
      "kjhi": 961,
      "igg": 962,
      "ddbbb": 963,
      "ffdg": 964,
      "kkl": 965,
      "llkkkk": 966,
      "hghe": 967,
      "hiki": 968,
      "bbbdc": 969,
      "ddddd": 970,
      "feeed": 971,
      "gecc": 972,
      "gefe": 973,
      "fheg": 974,
      "lkg": 975,
      "lklkk": 976,
      "jhjh": 977,
      "fihi": 978,
      "dbdc": 979,
      "kjjjkk": 980,
      "bbccbc": 981,
      "kjkjj": 982,
      "die": 983,
      "dddddddddddddddd": 984,
      "fkg": 985,
      "ddfh": 986,
      "dddce": 987,
      "eed": 988,
      "eefe": 989,
      "eefg": 990,
      "kkg": 991,
      "jjiii": 992,
      "bbbbbbbbbbbbbbbbbbbbc": 993,
      "fgde": 994,
      "fgeee": 995,
      "fghe": 996,
      "jigi": 997,
      "jijji": 998,
      "geb": 999
    },
    "merges": [
      [
        "b",
        "b"
      ],
      [
        "c",
        "c"
      ],
      [
        "bb",
        "bb"
      ],
      [
        "d",
        "d"
      ],
      [
        "e",
        "e"
      ],
      [
        "bbbb",
        "bbbb"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "f",
        "f"
      ],
      [
        "k",
        "k"
      ],
      [
        "g",
        "g"
      ],
      [
        "j",
        "j"
      ],
      [
        "h",
        "h"
      ],
      [
        "i",
        "i"
      ],
      [
        "bbbbbbbb",
        "bbbbbbbb"
      ],
      [
        "f",
        "e"
      ],
      [
        "cccc",
        "cccc"
      ],
      [
        "l",
        "l"
      ],
      [
        "b",
        "c"
      ],
      [
        "d",
        "e"
      ],
      [
        "f",
        "g"
      ],
      [
        "d",
        "c"
      ],
      [
        "h",
        "g"
      ],
      [
        "h",
        "i"
      ],
      [
        "j",
        "i"
      ],
      [
        "bb",
        "b"
      ],
      [
        "dd",
        "dd"
      ],
      [
        "j",
        "k"
      ],
      [
        "cc",
        "c"
      ],
      [
        "kk",
        "kk"
      ],
      [
        "f",
        "ee"
      ],
      [
        "g",
        "e"
      ],
      [
        "f",
        "d"
      ],
      [
        "f",
        "h"
      ],
      [
        "cccccccc",
        "cccccccc"
      ],
      [
        "bb",
        "c"
      ],
      [
        "ee",
        "e"
      ],
      [
        "g",
        "h"
      ],
      [
        "f",
        "c"
      ],
      [
        "g",
        "i"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbb"
      ],
      [
        "l",
        "k"
      ],
      [
        "j",
        "h"
      ],
      [
        "f",
        "i"
      ],
      [
        "d",
        "b"
      ],
      [
        "f",
        "gg"
      ],
      [
        "d",
        "ee"
      ],
      [
        "ff",
        "e"
      ],
      [
        "d",
        "g"
      ],
      [
        "k",
        "i"
      ],
      [
        "dd",
        "e"
      ],
      [
        "c",
        "b"
      ],
      [
        "ll",
        "ll"
      ],
      [
        "d",
        "cc"
      ],
      [
        "jj",
        "jj"
      ],
      [
        "h",
        "e"
      ],
      [
        "j",
        "ii"
      ],
      [
        "b",
        "e"
      ],
      [
        "j",
        "kk"
      ],
      [
        "ff",
        "ff"
      ],
      [
        "b",
        "cc"
      ],
      [
        "n",
        "n"
      ],
      [
        "j",
        "g"
      ],
      [
        "c",
        "e"
      ],
      [
        "ee",
        "ee"
      ],
      [
        "bb",
        "bc"
      ],
      [
        "m",
        "m"
      ],
      [
        "bbbbbbbb",
        "bbbb"
      ],
      [
        "i",
        "h"
      ],
      [
        "dd",
        "c"
      ],
      [
        "d",
        "f"
      ],
      [
        "h",
        "gg"
      ],
      [
        "ff",
        "g"
      ],
      [
        "i",
        "g"
      ],
      [
        "k",
        "l"
      ],
      [
        "dd",
        "d"
      ],
      [
        "j",
        "l"
      ],
      [
        "e",
        "g"
      ],
      [
        "k",
        "jj"
      ],
      [
        "bbbb",
        "b"
      ],
      [
        "gg",
        "g"
      ],
      [
        "hh",
        "i"
      ],
      [
        "ii",
        "i"
      ],
      [
        "b",
        "d"
      ],
      [
        "bbbb",
        "bb"
      ],
      [
        "cccccccccccccccc",
        "cccccccccccccccc"
      ],
      [
        "kkkk",
        "kkkk"
      ],
      [
        "f",
        "dd"
      ],
      [
        "cccc",
        "c"
      ],
      [
        "hh",
        "g"
      ],
      [
        "jj",
        "i"
      ],
      [
        "e",
        "c"
      ],
      [
        "f",
        "de"
      ],
      [
        "k",
        "j"
      ],
      [
        "e",
        "d"
      ],
      [
        "f",
        "b"
      ],
      [
        "k",
        "h"
      ],
      [
        "bc",
        "b"
      ],
      [
        "bb",
        "cc"
      ],
      [
        "hh",
        "h"
      ],
      [
        "d",
        "h"
      ],
      [
        "fg",
        "e"
      ],
      [
        "bbbb",
        "bbb"
      ],
      [
        "f",
        "hg"
      ],
      [
        "l",
        "kk"
      ],
      [
        "gg",
        "gg"
      ],
      [
        "cccc",
        "cc"
      ],
      [
        "fe",
        "g"
      ],
      [
        "c",
        "d"
      ],
      [
        "dd",
        "de"
      ],
      [
        "j",
        "hi"
      ],
      [
        "k",
        "jk"
      ],
      [
        "k",
        "g"
      ],
      [
        "f",
        "hh"
      ],
      [
        "dc",
        "e"
      ],
      [
        "fee",
        "e"
      ],
      [
        "f",
        "j"
      ],
      [
        "f",
        "cc"
      ],
      [
        "l",
        "m"
      ],
      [
        "h",
        "ii"
      ],
      [
        "d",
        "i"
      ],
      [
        "hh",
        "hh"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "d",
        "fe"
      ],
      [
        "ff",
        "ee"
      ],
      [
        "d",
        "ccc"
      ],
      [
        "bb",
        "e"
      ],
      [
        "dddd",
        "dddd"
      ],
      [
        "b",
        "ccc"
      ],
      [
        "h",
        "j"
      ],
      [
        "dd",
        "ee"
      ],
      [
        "bbbb",
        "c"
      ],
      [
        "g",
        "c"
      ],
      [
        "l",
        "i"
      ],
      [
        "dd",
        "dc"
      ],
      [
        "k",
        "ll"
      ],
      [
        "cccc",
        "ccc"
      ],
      [
        "jk",
        "i"
      ],
      [
        "hg",
        "i"
      ],
      [
        "f",
        "dc"
      ],
      [
        "k",
        "ji"
      ],
      [
        "dd",
        "cc"
      ],
      [
        "d",
        "ff"
      ],
      [
        "j",
        "e"
      ],
      [
        "j",
        "hh"
      ],
      [
        "llll",
        "llll"
      ],
      [
        "ff",
        "fg"
      ],
      [
        "d",
        "bb"
      ],
      [
        "nn",
        "nn"
      ],
      [
        "hi",
        "g"
      ],
      [
        "b",
        "g"
      ],
      [
        "ff",
        "fe"
      ],
      [
        "k",
        "lk"
      ],
      [
        "gg",
        "e"
      ],
      [
        "k",
        "ii"
      ],
      [
        "fg",
        "h"
      ],
      [
        "f",
        "ii"
      ],
      [
        "gg",
        "h"
      ],
      [
        "dc",
        "b"
      ],
      [
        "d",
        "bc"
      ],
      [
        "jj",
        "kk"
      ],
      [
        "d",
        "eee"
      ],
      [
        "f",
        "hi"
      ],
      [
        "fg",
        "i"
      ],
      [
        "dd",
        "g"
      ],
      [
        "bbbb",
        "bc"
      ],
      [
        "gg",
        "i"
      ],
      [
        "c",
        "g"
      ],
      [
        "cc",
        "b"
      ],
      [
        "ii",
        "ii"
      ],
      [
        "bbbbbbbb",
        "bb"
      ],
      [
        "de",
        "de"
      ],
      [
        "ji",
        "h"
      ],
      [
        "bc",
        "bc"
      ],
      [
        "hg",
        "e"
      ],
      [
        "hg",
        "h"
      ],
      [
        "bbbbbbbb",
        "bbb"
      ],
      [
        "ee",
        "g"
      ],
      [
        "ff",
        "gg"
      ],
      [
        "hi",
        "h"
      ],
      [
        "dd",
        "b"
      ],
      [
        "ff",
        "h"
      ],
      [
        "fe",
        "c"
      ],
      [
        "kkkk",
        "kk"
      ],
      [
        "e",
        "h"
      ],
      [
        "e",
        "i"
      ],
      [
        "bbbbbbbb",
        "b"
      ],
      [
        "ji",
        "g"
      ],
      [
        "de",
        "c"
      ],
      [
        "fe",
        "fe"
      ],
      [
        "f",
        "bb"
      ],
      [
        "k",
        "m"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbb"
      ],
      [
        "bbb",
        "cc"
      ],
      [
        "fee",
        "ee"
      ],
      [
        "e",
        "b"
      ],
      [
        "jk",
        "jj"
      ],
      [
        "c",
        "bb"
      ],
      [
        "de",
        "g"
      ],
      [
        "ge",
        "g"
      ],
      [
        "ff",
        "i"
      ],
      [
        "j",
        "hg"
      ],
      [
        "dc",
        "d"
      ],
      [
        "j",
        "ll"
      ],
      [
        "fgg",
        "g"
      ],
      [
        "bbbb",
        "bbc"
      ],
      [
        "ff",
        "c"
      ],
      [
        "fd",
        "g"
      ],
      [
        "ji",
        "jj"
      ],
      [
        "n",
        "m"
      ],
      [
        "bc",
        "bb"
      ],
      [
        "d",
        "fg"
      ],
      [
        "j",
        "lk"
      ],
      [
        "ii",
        "h"
      ],
      [
        "ee",
        "c"
      ],
      [
        "bc",
        "e"
      ],
      [
        "d",
        "gg"
      ],
      [
        "f",
        "dddd"
      ],
      [
        "b",
        "cccc"
      ],
      [
        "j",
        "gi"
      ],
      [
        "jj",
        "h"
      ],
      [
        "k",
        "jkk"
      ],
      [
        "cc",
        "e"
      ],
      [
        "bbbb",
        "bbbc"
      ],
      [
        "d",
        "cccc"
      ],
      [
        "fd",
        "ee"
      ],
      [
        "j",
        "gg"
      ],
      [
        "bbc",
        "b"
      ],
      [
        "h",
        "c"
      ],
      [
        "jii",
        "i"
      ],
      [
        "f",
        "k"
      ],
      [
        "dc",
        "dc"
      ],
      [
        "f",
        "ccc"
      ],
      [
        "hg",
        "hh"
      ],
      [
        "fh",
        "e"
      ],
      [
        "fi",
        "g"
      ],
      [
        "dee",
        "ee"
      ],
      [
        "bb",
        "ccc"
      ],
      [
        "j",
        "m"
      ],
      [
        "l",
        "mm"
      ],
      [
        "f",
        "dde"
      ],
      [
        "ii",
        "g"
      ],
      [
        "fc",
        "e"
      ],
      [
        "fe",
        "ff"
      ],
      [
        "i",
        "e"
      ],
      [
        "gi",
        "g"
      ],
      [
        "kl",
        "kk"
      ],
      [
        "l",
        "h"
      ],
      [
        "fe",
        "d"
      ],
      [
        "fg",
        "fg"
      ],
      [
        "dddd",
        "e"
      ],
      [
        "jj",
        "g"
      ],
      [
        "cccccccccccccccccccccccccccccccc",
        "cccccccccccccccccccccccccccccccc"
      ],
      [
        "kk",
        "i"
      ],
      [
        "j",
        "gh"
      ],
      [
        "ji",
        "ji"
      ],
      [
        "hi",
        "hh"
      ],
      [
        "d",
        "ge"
      ],
      [
        "db",
        "e"
      ],
      [
        "d",
        "fc"
      ],
      [
        "f",
        "bc"
      ],
      [
        "j",
        "kkkk"
      ],
      [
        "fe",
        "h"
      ],
      [
        "bbb",
        "e"
      ],
      [
        "jjjj",
        "jjjj"
      ],
      [
        "fg",
        "ff"
      ],
      [
        "k",
        "e"
      ],
      [
        "ll",
        "kk"
      ],
      [
        "k",
        "jh"
      ],
      [
        "jj",
        "ii"
      ],
      [
        "kkkkkkkk",
        "kkkkkkkk"
      ],
      [
        "c",
        "bc"
      ],
      [
        "dd",
        "h"
      ],
      [
        "b",
        "ee"
      ],
      [
        "d",
        "fd"
      ],
      [
        "dd",
        "dee"
      ],
      [
        "jj",
        "ji"
      ],
      [
        "bb",
        "d"
      ],
      [
        "hh",
        "gg"
      ],
      [
        "fe",
        "de"
      ],
      [
        "gi",
        "h"
      ],
      [
        "g",
        "ee"
      ],
      [
        "fg",
        "ee"
      ],
      [
        "gh",
        "e"
      ],
      [
        "b",
        "dc"
      ],
      [
        "cccccccccccccccc",
        "cccccccc"
      ],
      [
        "hh",
        "e"
      ],
      [
        "eeee",
        "ee"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbb"
      ],
      [
        "l",
        "jj"
      ],
      [
        "l",
        "jk"
      ],
      [
        "db",
        "cc"
      ],
      [
        "b",
        "cccccccc"
      ],
      [
        "dc",
        "dd"
      ],
      [
        "gh",
        "gg"
      ],
      [
        "k",
        "jjjj"
      ],
      [
        "fi",
        "h"
      ],
      [
        "d",
        "fee"
      ],
      [
        "l",
        "g"
      ],
      [
        "d",
        "bbb"
      ],
      [
        "cb",
        "cc"
      ],
      [
        "j",
        "f"
      ],
      [
        "fe",
        "dd"
      ],
      [
        "k",
        "hi"
      ],
      [
        "de",
        "dd"
      ],
      [
        "bbbbbbbbbbbb",
        "bb"
      ],
      [
        "c",
        "ee"
      ],
      [
        "f",
        "be"
      ],
      [
        "k",
        "hh"
      ],
      [
        "jk",
        "h"
      ],
      [
        "ll",
        "lk"
      ],
      [
        "dc",
        "g"
      ],
      [
        "dddd",
        "dd"
      ],
      [
        "ll",
        "m"
      ],
      [
        "b",
        "h"
      ],
      [
        "j",
        "c"
      ],
      [
        "d",
        "bbc"
      ],
      [
        "g",
        "ff"
      ],
      [
        "jh",
        "ii"
      ],
      [
        "mm",
        "mm"
      ],
      [
        "hh",
        "ii"
      ],
      [
        "hh",
        "hi"
      ],
      [
        "nnnn",
        "nnnn"
      ],
      [
        "l",
        "kkkk"
      ],
      [
        "lk",
        "i"
      ],
      [
        "b",
        "de"
      ],
      [
        "hg",
        "hg"
      ],
      [
        "bb",
        "g"
      ],
      [
        "bbbb",
        "cc"
      ],
      [
        "jj",
        "jk"
      ],
      [
        "ccc",
        "b"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbb"
      ],
      [
        "c",
        "dd"
      ],
      [
        "ki",
        "h"
      ],
      [
        "ff",
        "ffe"
      ],
      [
        "dc",
        "de"
      ],
      [
        "fc",
        "b"
      ],
      [
        "ff",
        "eee"
      ],
      [
        "fe",
        "i"
      ],
      [
        "he",
        "g"
      ],
      [
        "c",
        "h"
      ],
      [
        "fee",
        "g"
      ],
      [
        "bbbbbbbbbbbb",
        "b"
      ],
      [
        "fh",
        "gg"
      ],
      [
        "dcc",
        "e"
      ],
      [
        "hgg",
        "g"
      ],
      [
        "bb",
        "cccc"
      ],
      [
        "fe",
        "b"
      ],
      [
        "f",
        "jj"
      ],
      [
        "fe",
        "fg"
      ],
      [
        "jk",
        "ji"
      ],
      [
        "hh",
        "hg"
      ],
      [
        "ff",
        "ge"
      ],
      [
        "ffe",
        "g"
      ],
      [
        "fd",
        "cc"
      ],
      [
        "bbc",
        "bc"
      ],
      [
        "bbbbbbbbbbbb",
        "bbb"
      ],
      [
        "jl",
        "kk"
      ],
      [
        "c",
        "dc"
      ],
      [
        "de",
        "h"
      ],
      [
        "fgg",
        "gg"
      ],
      [
        "d",
        "bbbb"
      ],
      [
        "dd",
        "ccc"
      ],
      [
        "jl",
        "i"
      ],
      [
        "l",
        "j"
      ],
      [
        "ki",
        "g"
      ],
      [
        "cb",
        "e"
      ],
      [
        "mm",
        "m"
      ],
      [
        "c",
        "de"
      ],
      [
        "d",
        "j"
      ],
      [
        "k",
        "jii"
      ],
      [
        "dd",
        "dg"
      ],
      [
        "dd",
        "ce"
      ],
      [
        "cccccccc",
        "cccc"
      ],
      [
        "ee",
        "eee"
      ],
      [
        "hi",
        "hi"
      ],
      [
        "jk",
        "jk"
      ],
      [
        "fgg",
        "e"
      ],
      [
        "ff",
        "fee"
      ],
      [
        "f",
        "ji"
      ],
      [
        "de",
        "i"
      ],
      [
        "fg",
        "fe"
      ],
      [
        "jkk",
        "i"
      ],
      [
        "g",
        "b"
      ],
      [
        "dc",
        "bc"
      ],
      [
        "d",
        "gh"
      ],
      [
        "fe",
        "fee"
      ],
      [
        "ccc",
        "e"
      ],
      [
        "j",
        "ge"
      ],
      [
        "l",
        "ji"
      ],
      [
        "ff",
        "d"
      ],
      [
        "fg",
        "hg"
      ],
      [
        "ffff",
        "g"
      ],
      [
        "c",
        "bbb"
      ],
      [
        "b",
        "dd"
      ],
      [
        "f",
        "ddc"
      ],
      [
        "kjj",
        "i"
      ],
      [
        "f",
        "bbb"
      ],
      [
        "ee",
        "de"
      ],
      [
        "ff",
        "fh"
      ],
      [
        "jjjj",
        "i"
      ],
      [
        "k",
        "hg"
      ],
      [
        "k",
        "llll"
      ],
      [
        "kk",
        "jj"
      ],
      [
        "k",
        "jg"
      ],
      [
        "ji",
        "hh"
      ],
      [
        "jk",
        "ii"
      ],
      [
        "eee",
        "g"
      ],
      [
        "h",
        "d"
      ],
      [
        "bbbb",
        "be"
      ],
      [
        "fg",
        "hh"
      ],
      [
        "f",
        "jh"
      ],
      [
        "f",
        "ddd"
      ],
      [
        "fi",
        "e"
      ],
      [
        "k",
        "gg"
      ],
      [
        "de",
        "dc"
      ],
      [
        "de",
        "dee"
      ],
      [
        "dddd",
        "c"
      ],
      [
        "kl",
        "i"
      ],
      [
        "llllllll",
        "llllllll"
      ],
      [
        "ff",
        "fgg"
      ],
      [
        "fe",
        "ge"
      ],
      [
        "bc",
        "bcc"
      ],
      [
        "eeee",
        "eeee"
      ],
      [
        "j",
        "d"
      ],
      [
        "bc",
        "bbc"
      ],
      [
        "fc",
        "g"
      ],
      [
        "dcc",
        "b"
      ],
      [
        "cc",
        "g"
      ],
      [
        "bbbbbbbb",
        "c"
      ],
      [
        "cccc",
        "b"
      ],
      [
        "fe",
        "gg"
      ],
      [
        "fg",
        "c"
      ],
      [
        "ffff",
        "ffff"
      ],
      [
        "cccccccc",
        "cc"
      ],
      [
        "bc",
        "bbb"
      ],
      [
        "f",
        "jg"
      ],
      [
        "l",
        "n"
      ],
      [
        "ih",
        "ii"
      ],
      [
        "h",
        "ee"
      ],
      [
        "dd",
        "i"
      ],
      [
        "dd",
        "eee"
      ],
      [
        "gi",
        "e"
      ],
      [
        "g",
        "f"
      ],
      [
        "de",
        "fe"
      ],
      [
        "hi",
        "e"
      ],
      [
        "dc",
        "bb"
      ],
      [
        "fee",
        "eee"
      ],
      [
        "kk",
        "h"
      ],
      [
        "b",
        "i"
      ],
      [
        "cccccccc",
        "ccc"
      ],
      [
        "d",
        "hg"
      ],
      [
        "dd",
        "cb"
      ],
      [
        "bbbb",
        "e"
      ],
      [
        "bbbb",
        "bcc"
      ],
      [
        "dc",
        "dddd"
      ],
      [
        "nn",
        "m"
      ],
      [
        "df",
        "de"
      ],
      [
        "c",
        "i"
      ],
      [
        "dd",
        "dcc"
      ],
      [
        "d",
        "hh"
      ],
      [
        "gg",
        "fg"
      ],
      [
        "ji",
        "hi"
      ],
      [
        "ff",
        "cc"
      ],
      [
        "jj",
        "ki"
      ],
      [
        "fd",
        "b"
      ],
      [
        "f",
        "jk"
      ],
      [
        "ff",
        "de"
      ],
      [
        "jj",
        "j"
      ],
      [
        "de",
        "dddd"
      ],
      [
        "b",
        "f"
      ],
      [
        "d",
        "ffe"
      ],
      [
        "cc",
        "bb"
      ],
      [
        "dd",
        "fe"
      ],
      [
        "bbbbbbbb",
        "bc"
      ],
      [
        "gg",
        "hh"
      ],
      [
        "fd",
        "h"
      ],
      [
        "d",
        "fh"
      ],
      [
        "hg",
        "ii"
      ],
      [
        "bbb",
        "ccc"
      ],
      [
        "f",
        "l"
      ],
      [
        "f",
        "kk"
      ],
      [
        "jj",
        "ih"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbb"
      ],
      [
        "jk",
        "l"
      ],
      [
        "nn",
        "n"
      ],
      [
        "h",
        "b"
      ],
      [
        "bbbbbbbb",
        "bbbc"
      ],
      [
        "hg",
        "hi"
      ],
      [
        "f",
        "cccc"
      ],
      [
        "ff",
        "b"
      ],
      [
        "bbc",
        "bb"
      ],
      [
        "dee",
        "eee"
      ],
      [
        "hgg",
        "gg"
      ],
      [
        "d",
        "ccccc"
      ],
      [
        "j",
        "fg"
      ],
      [
        "ee",
        "i"
      ],
      [
        "ii",
        "hi"
      ],
      [
        "dde",
        "g"
      ],
      [
        "kl",
        "m"
      ],
      [
        "d",
        "fi"
      ],
      [
        "g",
        "d"
      ],
      [
        "ee",
        "h"
      ],
      [
        "ji",
        "kk"
      ],
      [
        "lk",
        "lk"
      ],
      [
        "jh",
        "e"
      ],
      [
        "fgg",
        "h"
      ],
      [
        "ff",
        "gh"
      ],
      [
        "dc",
        "ee"
      ],
      [
        "bbc",
        "e"
      ],
      [
        "f",
        "hhg"
      ],
      [
        "k",
        "jl"
      ],
      [
        "cc",
        "bc"
      ],
      [
        "ii",
        "ji"
      ],
      [
        "jk",
        "g"
      ],
      [
        "ge",
        "i"
      ],
      [
        "d",
        "he"
      ],
      [
        "dd",
        "db"
      ],
      [
        "bbbbbbbb",
        "bbc"
      ],
      [
        "cccccccc",
        "c"
      ],
      [
        "ll",
        "i"
      ],
      [
        "fd",
        "fe"
      ],
      [
        "llll",
        "ll"
      ],
      [
        "jii",
        "g"
      ],
      [
        "kjj",
        "kk"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbb"
      ],
      [
        "de",
        "dde"
      ],
      [
        "dc",
        "dcc"
      ],
      [
        "l",
        "ii"
      ],
      [
        "hh",
        "gh"
      ],
      [
        "k",
        "gi"
      ],
      [
        "cccc",
        "cb"
      ],
      [
        "ff",
        "hg"
      ],
      [
        "hh",
        "ih"
      ],
      [
        "ii",
        "jj"
      ],
      [
        "cccccccc",
        "ccccccc"
      ],
      [
        "ge",
        "c"
      ],
      [
        "bbbc",
        "b"
      ],
      [
        "d",
        "gi"
      ],
      [
        "h",
        "jj"
      ],
      [
        "i",
        "j"
      ],
      [
        "l",
        "jkk"
      ],
      [
        "ff",
        "fd"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbb"
      ],
      [
        "de",
        "cc"
      ],
      [
        "dc",
        "ddc"
      ],
      [
        "dddd",
        "dde"
      ],
      [
        "jk",
        "jkk"
      ],
      [
        "bbc",
        "bbc"
      ],
      [
        "jjjj",
        "jj"
      ],
      [
        "bcc",
        "b"
      ],
      [
        "e",
        "f"
      ],
      [
        "k",
        "gh"
      ],
      [
        "fe",
        "cc"
      ],
      [
        "bc",
        "g"
      ],
      [
        "jh",
        "gg"
      ],
      [
        "ee",
        "b"
      ],
      [
        "kk",
        "ki"
      ],
      [
        "hg",
        "fg"
      ],
      [
        "fgg",
        "i"
      ],
      [
        "jii",
        "ii"
      ],
      [
        "ce",
        "g"
      ],
      [
        "eeee",
        "eee"
      ],
      [
        "bbcc",
        "b"
      ],
      [
        "l",
        "e"
      ],
      [
        "ff",
        "hh"
      ],
      [
        "fe",
        "ffe"
      ],
      [
        "he",
        "i"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "dd",
        "bb"
      ],
      [
        "dd",
        "bc"
      ],
      [
        "fg",
        "fh"
      ],
      [
        "ge",
        "h"
      ],
      [
        "hgg",
        "i"
      ],
      [
        "bcb",
        "ccc"
      ],
      [
        "h",
        "k"
      ],
      [
        "m",
        "i"
      ],
      [
        "fe",
        "dee"
      ],
      [
        "cccccccc",
        "ccccc"
      ],
      [
        "hi",
        "ji"
      ],
      [
        "jh",
        "ji"
      ],
      [
        "kkkkkkkk",
        "kk"
      ],
      [
        "kjk",
        "i"
      ],
      [
        "c",
        "bbbb"
      ],
      [
        "dc",
        "db"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "hg",
        "ff"
      ],
      [
        "hi",
        "jj"
      ],
      [
        "be",
        "g"
      ],
      [
        "hhh",
        "ii"
      ],
      [
        "f",
        "hhi"
      ],
      [
        "bbbb",
        "cb"
      ],
      [
        "ff",
        "dd"
      ],
      [
        "ff",
        "fc"
      ],
      [
        "hh",
        "gi"
      ],
      [
        "ge",
        "de"
      ],
      [
        "b",
        "db"
      ],
      [
        "k",
        "n"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bb"
      ],
      [
        "bbb",
        "d"
      ],
      [
        "bbb",
        "g"
      ],
      [
        "dddd",
        "de"
      ],
      [
        "jk",
        "ll"
      ],
      [
        "be",
        "c"
      ],
      [
        "j",
        "ee"
      ],
      [
        "j",
        "fh"
      ],
      [
        "m",
        "ll"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "b"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbb"
      ],
      [
        "hi",
        "hg"
      ],
      [
        "jk",
        "lk"
      ],
      [
        "fd",
        "i"
      ],
      [
        "bbbc",
        "bb"
      ],
      [
        "f",
        "bbbb"
      ],
      [
        "f",
        "bd"
      ],
      [
        "h",
        "ff"
      ],
      [
        "j",
        "hhi"
      ],
      [
        "k",
        "iii"
      ],
      [
        "bb",
        "ee"
      ],
      [
        "dd",
        "fg"
      ],
      [
        "jj",
        "jii"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbb"
      ],
      [
        "bc",
        "d"
      ],
      [
        "ji",
        "e"
      ],
      [
        "fd",
        "eee"
      ],
      [
        "lk",
        "ll"
      ],
      [
        "dg",
        "ee"
      ],
      [
        "b",
        "fe"
      ],
      [
        "c",
        "gg"
      ],
      [
        "dc",
        "bcc"
      ],
      [
        "kl",
        "kkkk"
      ],
      [
        "kj",
        "kkkk"
      ],
      [
        "m",
        "n"
      ],
      [
        "jj",
        "jkk"
      ],
      [
        "hi",
        "gi"
      ],
      [
        "bbb",
        "cccc"
      ],
      [
        "ccc",
        "bc"
      ],
      [
        "fc",
        "bb"
      ],
      [
        "ih",
        "gg"
      ],
      [
        "f",
        "ki"
      ],
      [
        "j",
        "ff"
      ],
      [
        "gg",
        "ff"
      ],
      [
        "gg",
        "hg"
      ],
      [
        "de",
        "d"
      ],
      [
        "dddd",
        "dc"
      ],
      [
        "fh",
        "ee"
      ],
      [
        "f",
        "hhh"
      ],
      [
        "h",
        "kk"
      ],
      [
        "h",
        "fg"
