{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "0": 4,
      "1": 5,
      "2": 6,
      "3": 7,
      "4": 8,
      "5": 9,
      "6": 10,
      "7": 11,
      "8": 12,
      "9": 13,
      "b": 14,
      "c": 15,
      "d": 16,
      "e": 17,
      "f": 18,
      "g": 19,
      "h": 20,
      "i": 21,
      "j": 22,
      "k": 23,
      "l": 24,
      "m": 25,
      "n": 26,
      "bb": 27,
      "cc": 28,
      "bbbb": 29,
      "dd": 30,
      "ee": 31,
      "bbbbbbbb": 32,
      "cccc": 33,
      "ff": 34,
      "kk": 35,
      "gg": 36,
      "jj": 37,
      "hh": 38,
      "ii": 39,
      "bbbbbbbbbbbbbbbb": 40,
      "fe": 41,
      "cccccccc": 42,
      "ll": 43,
      "bc": 44,
      "de": 45,
      "fg": 46,
      "dc": 47,
      "hg": 48,
      "hi": 49,
      "ji": 50,
      "bbb": 51,
      "dddd": 52,
      "jk": 53,
      "ccc": 54,
      "kkkk": 55,
      "fee": 56,
      "ge": 57,
      "fd": 58,
      "fh": 59,
      "cccccccccccccccc": 60,
      "bbc": 61,
      "eee": 62,
      "gh": 63,
      "fc": 64,
      "gi": 65,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 66,
      "lk": 67,
      "jh": 68,
      "fi": 69,
      "db": 70,
      "fgg": 71,
      "dee": 72,
      "ffe": 73,
      "dg": 74,
      "ki": 75,
      "dde": 76,
      "cb": 77,
      "llll": 78,
      "dcc": 79,
      "jjjj": 80,
      "he": 81,
      "jii": 82,
      "be": 83,
      "jkk": 84,
      "ffff": 85,
      "bcc": 86,
      "nn": 87,
      "jg": 88,
      "ce": 89,
      "eeee": 90,
      "bbbc": 91,
      "mm": 92,
      "bbbbbbbbbbbb": 93,
      "ih": 94,
      "ddc": 95,
      "df": 96,
      "hgg": 97,
      "ffg": 98,
      "ig": 99,
      "kl": 100,
      "ddd": 101,
      "jl": 102,
      "eg": 103,
      "kjj": 104,
      "bbbbb": 105,
      "ggg": 106,
      "hhi": 107,
      "iii": 108,
      "bd": 109,
      "bbbbbb": 110,
      "cccccccccccccccccccccccccccccccc": 111,
      "kkkkkkkk": 112,
      "fdd": 113,
      "ccccc": 114,
      "hhg": 115,
      "jji": 116,
      "ec": 117,
      "fde": 118,
      "kj": 119,
      "ed": 120,
      "fb": 121,
      "kh": 122,
      "bcb": 123,
      "bbcc": 124,
      "hhh": 125,
      "dh": 126,
      "fge": 127,
      "bbbbbbb": 128,
      "fhg": 129,
      "lkk": 130,
      "gggg": 131,
      "cccccc": 132,
      "feg": 133,
      "cd": 134,
      "ddde": 135,
      "jhi": 136,
      "kjk": 137,
      "kg": 138,
      "fhh": 139,
      "dce": 140,
      "feee": 141,
      "fj": 142,
      "fcc": 143,
      "lm": 144,
      "hii": 145,
      "di": 146,
      "hhhh": 147,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 148,
      "dfe": 149,
      "ffee": 150,
      "dccc": 151,
      "bbe": 152,
      "dddddddd": 153,
      "bccc": 154,
      "hj": 155,
      "ddee": 156,
      "bbbbc": 157,
      "gc": 158,
      "li": 159,
      "dddc": 160,
      "kll": 161,
      "ccccccc": 162,
      "jki": 163,
      "hgi": 164,
      "fdc": 165,
      "kji": 166,
      "ddcc": 167,
      "dff": 168,
      "je": 169,
      "jhh": 170,
      "llllllll": 171,
      "fffg": 172,
      "dbb": 173,
      "nnnn": 174,
      "hig": 175,
      "bg": 176,
      "fffe": 177,
      "klk": 178,
      "gge": 179,
      "kii": 180,
      "fgh": 181,
      "fii": 182,
      "ggh": 183,
      "dcb": 184,
      "dbc": 185,
      "jjkk": 186,
      "deee": 187,
      "fhi": 188,
      "fgi": 189,
      "ddg": 190,
      "bbbbbc": 191,
      "ggi": 192,
      "cg": 193,
      "ccb": 194,
      "iiii": 195,
      "bbbbbbbbbb": 196,
      "dede": 197,
      "jih": 198,
      "bcbc": 199,
      "hge": 200,
      "hgh": 201,
      "bbbbbbbbbbb": 202,
      "eeg": 203,
      "ffgg": 204,
      "hih": 205,
      "ddb": 206,
      "ffh": 207,
      "fec": 208,
      "kkkkkk": 209,
      "eh": 210,
      "ei": 211,
      "bbbbbbbbb": 212,
      "jig": 213,
      "dec": 214,
      "fefe": 215,
      "fbb": 216,
      "km": 217,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbb": 218,
      "bbbcc": 219,
      "feeee": 220,
      "eb": 221,
      "jkjj": 222,
      "cbb": 223,
      "10": 224,
      "deg": 225,
      "geg": 226,
      "ffi": 227,
      "jhg": 228,
      "dcd": 229,
      "jll": 230,
      "fggg": 231,
      "bbbbbbc": 232,
      "ffc": 233,
      "fdg": 234,
      "jijj": 235,
      "nm": 236,
      "bcbb": 237,
      "dfg": 238,
      "jlk": 239,
      "iih": 240,
      "eec": 241,
      "bce": 242,
      "dgg": 243,
      "fdddd": 244,
      "bcccc": 245,
      "jgi": 246,
      "jjh": 247,
      "kjkk": 248,
      "cce": 249,
      "bbbbbbbc": 250,
      "dcccc": 251,
      "fdee": 252,
      "jgg": 253,
      "bbcb": 254,
      "hc": 255,
      "jiii": 256,
      "fk": 257,
      "dcdc": 258,
      "fccc": 259,
      "hghh": 260,
      "fhe": 261,
      "fig": 262,
      "deeee": 263,
      "bbccc": 264,
      "jm": 265,
      "lmm": 266,
      "fdde": 267,
      "iig": 268,
      "fce": 269,
      "feff": 270,
      "ie": 271,
      "gig": 272,
      "klkk": 273,
      "11": 274,
      "lh": 275,
      "fed": 276,
      "fgfg": 277,
      "dddde": 278,
      "jjg": 279,
      "12": 280,
      "cccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccc": 281,
      "kki": 282,
      "jgh": 283,
      "jiji": 284,
      "hihh": 285,
      "dge": 286,
      "dbe": 287,
      "dfc": 288,
      "fbc": 289,
      "jkkkk": 290,
      "feh": 291,
      "bbbe": 292,
      "jjjjjjjj": 293,
      "fgff": 294,
      "ke": 295,
      "llkk": 296,
      "kjh": 297,
      "jjii": 298,
      "kkkkkkkkkkkkkkkk": 299,
      "cbc": 300,
      "ddh": 301,
      "bee": 302,
      "dfd": 303,
      "dddee": 304,
      "jjji": 305,
      "bbd": 306,
      "hhgg": 307,
      "fede": 308,
      "gih": 309,
      "gee": 310,
      "fgee": 311,
      "ghe": 312,
      "bdc": 313,
      "cccccccccccccccccccccccc": 314,
      "hhe": 315,
      "eeeeee": 316,
      "bbbbbbbbbbbbbbbbbbbbbbbb": 317,
      "ljj": 318,
      "ljk": 319,
      "dbcc": 320,
      "bcccccccc": 321,
      "dcdd": 322,
      "ghgg": 323,
      "kjjjj": 324,
      "fih": 325,
      "dfee": 326,
      "lg": 327,
      "dbbb": 328,
      "cbcc": 329,
      "jf": 330,
      "fedd": 331,
      "khi": 332,
      "dedd": 333,
      "bbbbbbbbbbbbbb": 334,
      "cee": 335,
      "fbe": 336,
      "khh": 337,
      "jkh": 338,
      "15": 339,
      "lllk": 340,
      "dcg": 341,
      "dddddd": 342,
      "llm": 343,
      "13": 344,
      "bh": 345,
      "jc": 346,
      "dbbc": 347,
      "gff": 348,
      "jhii": 349,
      "mmmm": 350,
      "hhii": 351,
      "hhhi": 352,
      "nnnnnnnn": 353,
      "lkkkk": 354,
      "lki": 355,
      "bde": 356,
      "hghg": 357,
      "bbg": 358,
      "bbbbcc": 359,
      "14": 360,
      "jjjk": 361,
      "cccb": 362,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 363,
      "cdd": 364,
      "kih": 365,
      "ffffe": 366,
      "dcde": 367,
      "fcb": 368,
      "ffeee": 369,
      "fei": 370,
      "heg": 371,
      "ch": 372,
      "feeg": 373,
      "bbbbbbbbbbbbb": 374,
      "fhgg": 375,
      "dcce": 376,
      "hggg": 377,
      "bbcccc": 378,
      "feb": 379,
      "fjj": 380,
      "fefg": 381,
      "jkji": 382,
      "hhhg": 383,
      "ffge": 384,
      "ffeg": 385,
      "fdcc": 386,
      "16": 387,
      "bbcbc": 388,
      "bbbbbbbbbbbbbbb": 389,
      "jlkk": 390,
      "cdc": 391,
      "deh": 392,
      "fgggg": 393,
      "dbbbb": 394,
      "ddccc": 395,
      "jli": 396,
      "lj": 397,
      "kig": 398,
      "cbe": 399,
      "mmm": 400,
      "cde": 401,
      "dj": 402,
      "kjii": 403,
      "dddg": 404,
      "ddce": 405,
      "cccccccccccc": 406,
      "eeeee": 407,
      "hihi": 408,
      "jkjk": 409,
      "fgge": 410,
      "fffee": 411,
      "fji": 412,
      "dei": 413,
      "fgfe": 414,
      "jkki": 415,
      "gb": 416,
      "dcbc": 417,
      "dgh": 418,
      "fefee": 419,
      "ccce": 420,
      "jge": 421,
      "lji": 422,
      "ffd": 423,
      "fghg": 424,
      "ffffg": 425,
      "cbbb": 426,
      "bdd": 427,
      "fddc": 428,
      "kjji": 429,
      "fbbb": 430,
      "eede": 431,
      "fffh": 432,
      "jjjji": 433,
      "khg": 434,
      "kllll": 435,
      "kkjj": 436,
      "kjg": 437,
      "jihh": 438,
      "jkii": 439,
      "eeeg": 440,
      "hd": 441,
      "bbbbbe": 442,
      "fghh": 443,
      "fjh": 444,
      "fddd": 445,
      "fie": 446,
      "kgg": 447,
      "dedc": 448,
      "dedee": 449,
      "ddddc": 450,
      "kli": 451,
      "llllllllllllllll": 452,
      "fffgg": 453,
      "fege": 454,
      "bcbcc": 455,
      "eeeeeeee": 456,
      "jd": 457,
      "bcbbc": 458,
      "fcg": 459,
      "dccb": 460,
      "ccg": 461,
      "bbbbbbbbc": 462,
      "ccccb": 463,
      "fegg": 464,
      "fgc": 465,
      "ffffffff": 466,
      "cccccccccc": 467,
      "bcbbb": 468,
      "fjg": 469,
      "ln": 470,
      "ihii": 471,
      "18": 472,
      "hee": 473,
      "ddi": 474,
      "ddeee": 475,
      "gie": 476,
      "gf": 477,
      "defe": 478,
      "hie": 479,
      "dcbb": 480,
      "feeeee": 481,
      "kkh": 482,
      "bi": 483,
      "ccccccccccc": 484,
      "dhg": 485,
      "ddcb": 486,
      "bbbbe": 487,
      "bbbbbcc": 488,
      "dcdddd": 489,
      "nnm": 490,
      "dfde": 491,
      "ci": 492,
      "dddcc": 493,
      "dhh": 494,
      "ggfg": 495,
      "jihi": 496,
      "ffcc": 497,
      "jjki": 498,
      "fdb": 499,
      "fjk": 500,
      "ffde": 501,
      "jjj": 502,
      "dedddd": 503,
      "bf": 504,
      "dffe": 505,
      "ccbb": 506,
      "ddfe": 507,
      "bbbbbbbbbc": 508,
      "gghh": 509,
      "fdh": 510,
      "dfh": 511,
      "hgii": 512,
      "bbbccc": 513,
      "fl": 514,
      "fkk": 515,
      "jjih": 516,
      "bbbbbbbbbbbbbbbbbbb": 517,
      "jkl": 518,
      "nnn": 519,
      "17": 520,
      "19": 521,
      "20": 522,
      "hb": 523,
      "bbbbbbbbbbbc": 524,
      "hghi": 525,
      "fcccc": 526,
      "ffb": 527,
      "bbcbb": 528,
      "deeeee": 529,
      "hgggg": 530,
      "dccccc": 531,
      "jfg": 532,
      "eei": 533,
      "iihi": 534,
      "ddeg": 535,
      "klm": 536,
      "23": 537,
      "dfi": 538,
      "gd": 539,
      "eeh": 540,
      "jikk": 541,
      "lklk": 542,
      "jhe": 543,
      "fggh": 544,
      "21": 545,
      "ffgh": 546,
      "dcee": 547,
      "bbce": 548,
      "fhhg": 549,
      "kjl": 550,
      "ccbc": 551,
      "iiji": 552,
      "jkg": 553,
      "gei": 554,
      "dhe": 555,
      "dddb": 556,
      "bbbbbbbbbbc": 557,
      "ccccccccc": 558,
      "lli": 559,
      "fdfe": 560,
      "llllll": 561,
      "jiig": 562,
      "kjjkk": 563,
      "bbbbbbbbbbbbbbbbbbbb": 564,
      "dedde": 565,
      "dcdcc": 566,
      "lii": 567,
      "hhgh": 568,
      "kgi": 569,
      "cccccb": 570,
      "ffhg": 571,
      "hhih": 572,
      "iijj": 573,
      "ccccccccccccccc": 574,
      "gec": 575,
      "bbbcb": 576,
      "dgi": 577,
      "hjj": 578,
      "ij": 579,
      "ljkk": 580,
      "fffd": 581,
      "bbbbbbbbbbbbbbbbbbbbbb": 582,
      "decc": 583,
      "dcddc": 584,
      "dddddde": 585,
      "jkjkk": 586,
      "bbcbbc": 587,
      "jjjjjj": 588,
      "bccb": 589,
      "ef": 590,
      "kgh": 591,
      "fecc": 592,
      "bcg": 593,
      "jhgg": 594,
      "eeb": 595,
      "kkki": 596,
      "hgfg": 597,
      "fggi": 598,
      "jiiii": 599,
      "ceg": 600,
      "eeeeeee": 601,
      "bbccb": 602,
      "le": 603,
      "ffhh": 604,
      "feffe": 605,
      "hei": 606,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 607,
      "ddbb": 608,
      "ddbc": 609,
      "fgfh": 610,
      "geh": 611,
      "hggi": 612,
      "bcbccc": 613,
      "hk": 614,
      "mi": 615,
      "fedee": 616,
      "ccccccccccccc": 617,
      "hiji": 618,
      "jhji": 619,
      "kkkkkkkkkk": 620,
      "kjki": 621,
      "22": 622,
      "cbbbb": 623,
      "dcdb": 624,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 625,
      "hgff": 626,
      "hijj": 627,
      "beg": 628,
      "hhhii": 629,
      "fhhi": 630,
      "bbbbcb": 631,
      "ffdd": 632,
      "fffc": 633,
      "hhgi": 634,
      "gede": 635,
      "bdb": 636,
      "kn": 637,
      "bbbbbbbbbbbbbbbbbb": 638,
      "bbbd": 639,
      "bbbg": 640,
      "ddddde": 641,
      "jkll": 642,
      "bec": 643,
      "jee": 644,
      "jfh": 645,
      "mll": 646,
      "bbbbbbbbbbbbbbbbb": 647,
      "bbbbbbbbbbbbbbbbbbbbb": 648,
      "hihg": 649,
      "jklk": 650,
      "fdi": 651,
      "bbbcbb": 652,
      "fbbbb": 653,
      "fbd": 654,
      "hff": 655,
      "jhhi": 656,
      "kiii": 657,
      "bbee": 658,
      "ddfg": 659,
      "jjjii": 660,
      "bbbbbbbbbbbbbbbbbbbbbbb": 661,
      "bcd": 662,
      "jie": 663,
      "fdeee": 664,
      "lkll": 665,
      "dgee": 666,
      "bfe": 667,
      "cgg": 668,
      "dcbcc": 669,
      "klkkkk": 670,
      "kjkkkk": 671,
      "mn": 672,
      "jjjkk": 673,
      "higi": 674,
      "bbbcccc": 675,
      "cccbc": 676,
      "fcbb": 677,
      "ihgg": 678,
      "fki": 679,
      "jff": 680,
      "ggff": 681,
      "gghg": 682,
      "ded": 683,
      "dddddc": 684,
      "fhee": 685,
      "fhhh": 686,
      "hkk": 687,
      "hfg": 688,
      "jfi": 689,
      "fece": 690,
      "dfcc": 691,
      "cccccccccccccccccccccccccccccccccccccccccccccccc": 692,
      "24": 693,
      "cbbc": 694,
      "kd": 695,
      "ljh": 696,
      "ddeeee": 697,
      "higg": 698,
      "feefe": 699,
      "feeeeee": 700,
      "fhff": 701,
      "dbd": 702,
      "kijj": 703,
      "ecc": 704,
      "hji": 705,
      "hhig": 706,
      "iie": 707,
      "feffff": 708,
      "fhii": 709,
      "ffeff": 710,
      "bccbc": 711,
      "gggfg": 712,
      "fddee": 713,
      "fhgi": 714,
      "ml": 715,
      "bbdb": 716,
      "bbbbd": 717,
      "fgb": 718,
      "jkjh": 719,
      "feede": 720,
      "eeede": 721,
      "bbbcbc": 722,
      "dfb": 723,
      "ffgee": 724,
      "25": 725,
      "hf": 726,
      "jhhg": 727,
      "ddcccc": 728,
      "ddff": 729,
      "fegh": 730,
      "fgii": 731,
      "dci": 732,
      "ddddddd": 733,
      "fhfg": 734,
      "dbg": 735,
      "cec": 736,
      "bcccccc": 737,
      "dfgg": 738,
      "kc": 739,
      "hikk": 740,
      "jijh": 741,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 742,
      "lkl": 743,
      "deec": 744,
      "cbccc": 745,
      "ffffff": 746,
      "fdeg": 747,
      "bccccc": 748,
      "dhi": 749,
      "egg": 750,
      "jeg": 751,
      "jkkkkkk": 752,
      "fehg": 753,
      "fefc": 754,
      "dch": 755,
      "fdff": 756,
      "gigg": 757,
      "kikk": 758,
      "jiih": 759,
      "bbbbbbcc": 760,
      "nnnnnnnnnnnnnnnn": 761,
      "efg": 762,
      "jhgi": 763,
      "dddf": 764,
      "jjk": 765,
      "bcbbbb": 766,
      "deb": 767,
      "geff": 768,
      "bbcbbb": 769,
      "deeg": 770,
      "dgc": 771,
      "beb": 772,
      "bccbb": 773,
      "jhig": 774,
      "kllkk": 775,
      "fdce": 776,
      "mkk": 777,
      "ggc": 778,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbb": 779,
      "dcdde": 780,
      "jijk": 781,
      "gggggg": 782,
      "khe": 783,
      "ccd": 784,
      "jje": 785,
      "bbbbbbbbbbbbbbbbbbbbbbbbbb": 786,
      "deff": 787,
      "feeeg": 788,
      "gihh": 789,
      "dccbb": 790,
      "heh": 791,
      "hhihh": 792,
      "31": 793,
      "cf": 794,
      "jkkkkkkkk": 795,
      "iihh": 796,
      "fedde": 797,
      "lllkk": 798,
      "bcee": 799,
      "high": 800,
      "ddddddc": 801,
      "lkh": 802,
      "fihg": 803,
      "ffefe": 804,
      "bff": 805,
      "jjl": 806,
      "dedg": 807,
      "dece": 808,
      "dcbbb": 809,
      "cccg": 810,
      "ghii": 811,
      "gihg": 812,
      "figg": 813,
      "cbg": 814,
      "dddh": 815,
      "dcccccccc": 816,
      "dcccccc": 817,
      "jhhh": 818,
      "ccdc": 819,
      "eebb": 820,
      "eeff": 821,
      "cccce": 822,
      "ffce": 823,
      "fedg": 824,
      "lllm": 825,
      "feec": 826,
      "gefg": 827,
      "jhjj": 828,
      "kiji": 829,
      "dccg": 830,
      "fddg": 831,
      "fbg": 832,
      "lkkkkkk": 833,
      "bbi": 834,
      "cci": 835,
      "iiih": 836,
      "fecb": 837,
      "bcbbbc": 838,
      "fgfgg": 839,
      "jigg": 840,
      "jkih": 841,
      "bcce": 842,
      "kjjh": 843,
      "ggghh": 844,
      "hhihi": 845,
      "jjijj": 846,
      "dbbbbbb": 847,
      "bbbbccc": 848,
      "jjhh": 849,
      "feefee": 850,
      "ghfg": 851,
      "fihh": 852,
      "ddec": 853,
      "hec": 854,
      "fffffg": 855,
      "ddcdc": 856,
      "hggh": 857,
      "bdbb": 858,
      "fhge": 859,
      "26": 860,
      "dbbbc": 861,
      "dig": 862,
      "dbbbbb": 863,
      "fiii": 864,
      "nmm": 865,
      "ddgg": 866,
      "eegg": 867,
      "fefd": 868,
      "bcdc": 869,
      "bcbbbbbb": 870,
      "fch": 871,
      "fcee": 872,
      "bccbbc": 873,
      "jghh": 874,
      "jlm": 875,
      "ggghg": 876,
      "fje": 877,
      "dk": 878,
      "dii": 879,
      "fhig": 880,
      "ikk": 881,
      "jfe": 882,
      "ddbe": 883,
      "ffgi": 884,
      "ffeeee": 885,
      "fgcc": 886,
      "dcdg": 887,
      "ddddee": 888,
      "jkjjjj": 889,
      "jklkk": 890,
      "fhc": 891,
      "jgii": 892,
      "dfdd": 893,
      "ffgfg": 894,
      "dddccc": 895,
      "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb": 896,
      "27": 897,
      "30": 898,
      "bge": 899,
      "fbcc": 900,
      "ghh": 901,
      "jb": 902,
      "jde": 903,
      "mlk": 904,
      "ddge": 905,
      "jjig": 906,
      "jjkjj": 907,
      "fefh": 908,
      "hijh": 909,
      "deede": 910,
      "ffffgg": 911,
      "bbbbbbbbbbbbbbbc": 912,
      "cdb": 913,
      "kff": 914,
      "fehh": 915,
      "fgffe": 916,
      "hgee": 917,
      "hgig": 918,
      "jijkk": 919,
      "fhfe": 920,
      "cccccccccccccccccccc": 921,
      "ccccccccccccccccccc": 922,
      "eeedee": 923,
      "ffec": 924,
      "hgge": 925,
      "gggfgg": 926,
      "khii": 927,
      "bcbcccc": 928,
      "hiih": 929,
      "28": 930,
      "29": 931,
      "ic": 932,
      "jllll": 933,
      "khhi": 934,
      "bbdc": 935,
      "fff": 936,
      "jjhi": 937,
      "fefi": 938,
      "cccccccccccccc": 939,
      "gegg": 940,
      "fdbc": 941,
      "dbccc": 942,
      "ddede": 943,
      "dccbc": 944,
      "jiiji": 945,
      "bbbbbbbbbbbbbc": 946,
      "fiig": 947,
      "33": 948,
      "dccccccc": 949,
      "gcc": 950,
      "kmm": 951,
      "cch": 952,
      "kkkjj": 953,
      "hhfg": 954,
      "fef": 955,
      "llkll": 956,
      "fgih": 957,
      "jihg": 958,
      "ddddcc": 959,
      "dddddddc": 960,
      "fcde": 961,
      "lkjj": 962,
      "dccdc": 963,
      "jkkjj": 964,
      "bbbbbbbbbbbbc": 965,
      "ffgfe": 966,
      "gggggggg": 967,
      "fcce": 968,
      "hhhhhh": 969,
      "bcccb": 970,
      "ddcce": 971,
      "dbcb": 972,
      "ni": 973,
      "nl": 974,
      "bbh": 975,
      "ccccce": 976,
      "lll": 977,
      "fghi": 978,
      "ddddg": 979,
      "ddddddde": 980,
      "jkm": 981,
      "cccbb": 982,
      "feedee": 983,
      "fdgg": 984,
      "jiijj": 985,
      "nnnm": 986,
      "cei": 987,
      "bbbce": 988,
      "ddcg": 989,
      "ffgff": 990,
      "dddeee": 991,
      "fddde": 992,
      "kje": 993,
      "kjhi": 994,
      "igg": 995,
      "ddbbb": 996,
      "ffdg": 997,
      "kkl": 998,
      "llkkkk": 999
    },
    "merges": [
      [
        "b",
        "b"
      ],
      [
        "c",
        "c"
      ],
      [
        "bb",
        "bb"
      ],
      [
        "d",
        "d"
      ],
      [
        "e",
        "e"
      ],
      [
        "bbbb",
        "bbbb"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "f",
        "f"
      ],
      [
        "k",
        "k"
      ],
      [
        "g",
        "g"
      ],
      [
        "j",
        "j"
      ],
      [
        "h",
        "h"
      ],
      [
        "i",
        "i"
      ],
      [
        "bbbbbbbb",
        "bbbbbbbb"
      ],
      [
        "f",
        "e"
      ],
      [
        "cccc",
        "cccc"
      ],
      [
        "l",
        "l"
      ],
      [
        "b",
        "c"
      ],
      [
        "d",
        "e"
      ],
      [
        "f",
        "g"
      ],
      [
        "d",
        "c"
      ],
      [
        "h",
        "g"
      ],
      [
        "h",
        "i"
      ],
      [
        "j",
        "i"
      ],
      [
        "bb",
        "b"
      ],
      [
        "dd",
        "dd"
      ],
      [
        "j",
        "k"
      ],
      [
        "cc",
        "c"
      ],
      [
        "kk",
        "kk"
      ],
      [
        "f",
        "ee"
      ],
      [
        "g",
        "e"
      ],
      [
        "f",
        "d"
      ],
      [
        "f",
        "h"
      ],
      [
        "cccccccc",
        "cccccccc"
      ],
      [
        "bb",
        "c"
      ],
      [
        "ee",
        "e"
      ],
      [
        "g",
        "h"
      ],
      [
        "f",
        "c"
      ],
      [
        "g",
        "i"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbb"
      ],
      [
        "l",
        "k"
      ],
      [
        "j",
        "h"
      ],
      [
        "f",
        "i"
      ],
      [
        "d",
        "b"
      ],
      [
        "f",
        "gg"
      ],
      [
        "d",
        "ee"
      ],
      [
        "ff",
        "e"
      ],
      [
        "d",
        "g"
      ],
      [
        "k",
        "i"
      ],
      [
        "dd",
        "e"
      ],
      [
        "c",
        "b"
      ],
      [
        "ll",
        "ll"
      ],
      [
        "d",
        "cc"
      ],
      [
        "jj",
        "jj"
      ],
      [
        "h",
        "e"
      ],
      [
        "j",
        "ii"
      ],
      [
        "b",
        "e"
      ],
      [
        "j",
        "kk"
      ],
      [
        "ff",
        "ff"
      ],
      [
        "b",
        "cc"
      ],
      [
        "n",
        "n"
      ],
      [
        "j",
        "g"
      ],
      [
        "c",
        "e"
      ],
      [
        "ee",
        "ee"
      ],
      [
        "bb",
        "bc"
      ],
      [
        "m",
        "m"
      ],
      [
        "bbbbbbbb",
        "bbbb"
      ],
      [
        "i",
        "h"
      ],
      [
        "dd",
        "c"
      ],
      [
        "d",
        "f"
      ],
      [
        "h",
        "gg"
      ],
      [
        "ff",
        "g"
      ],
      [
        "i",
        "g"
      ],
      [
        "k",
        "l"
      ],
      [
        "dd",
        "d"
      ],
      [
        "j",
        "l"
      ],
      [
        "e",
        "g"
      ],
      [
        "k",
        "jj"
      ],
      [
        "bbbb",
        "b"
      ],
      [
        "gg",
        "g"
      ],
      [
        "hh",
        "i"
      ],
      [
        "ii",
        "i"
      ],
      [
        "b",
        "d"
      ],
      [
        "bbbb",
        "bb"
      ],
      [
        "cccccccccccccccc",
        "cccccccccccccccc"
      ],
      [
        "kkkk",
        "kkkk"
      ],
      [
        "f",
        "dd"
      ],
      [
        "cccc",
        "c"
      ],
      [
        "hh",
        "g"
      ],
      [
        "jj",
        "i"
      ],
      [
        "e",
        "c"
      ],
      [
        "f",
        "de"
      ],
      [
        "k",
        "j"
      ],
      [
        "e",
        "d"
      ],
      [
        "f",
        "b"
      ],
      [
        "k",
        "h"
      ],
      [
        "bc",
        "b"
      ],
      [
        "bb",
        "cc"
      ],
      [
        "hh",
        "h"
      ],
      [
        "d",
        "h"
      ],
      [
        "fg",
        "e"
      ],
      [
        "bbbb",
        "bbb"
      ],
      [
        "f",
        "hg"
      ],
      [
        "l",
        "kk"
      ],
      [
        "gg",
        "gg"
      ],
      [
        "cccc",
        "cc"
      ],
      [
        "fe",
        "g"
      ],
      [
        "c",
        "d"
      ],
      [
        "dd",
        "de"
      ],
      [
        "j",
        "hi"
      ],
      [
        "k",
        "jk"
      ],
      [
        "k",
        "g"
      ],
      [
        "f",
        "hh"
      ],
      [
        "dc",
        "e"
      ],
      [
        "fee",
        "e"
      ],
      [
        "f",
        "j"
      ],
      [
        "f",
        "cc"
      ],
      [
        "l",
        "m"
      ],
      [
        "h",
        "ii"
      ],
      [
        "d",
        "i"
      ],
      [
        "hh",
        "hh"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "d",
        "fe"
      ],
      [
        "ff",
        "ee"
      ],
      [
        "d",
        "ccc"
      ],
      [
        "bb",
        "e"
      ],
      [
        "dddd",
        "dddd"
      ],
      [
        "b",
        "ccc"
      ],
      [
        "h",
        "j"
      ],
      [
        "dd",
        "ee"
      ],
      [
        "bbbb",
        "c"
      ],
      [
        "g",
        "c"
      ],
      [
        "l",
        "i"
      ],
      [
        "dd",
        "dc"
      ],
      [
        "k",
        "ll"
      ],
      [
        "cccc",
        "ccc"
      ],
      [
        "jk",
        "i"
      ],
      [
        "hg",
        "i"
      ],
      [
        "f",
        "dc"
      ],
      [
        "k",
        "ji"
      ],
      [
        "dd",
        "cc"
      ],
      [
        "d",
        "ff"
      ],
      [
        "j",
        "e"
      ],
      [
        "j",
        "hh"
      ],
      [
        "llll",
        "llll"
      ],
      [
        "ff",
        "fg"
      ],
      [
        "d",
        "bb"
      ],
      [
        "nn",
        "nn"
      ],
      [
        "hi",
        "g"
      ],
      [
        "b",
        "g"
      ],
      [
        "ff",
        "fe"
      ],
      [
        "k",
        "lk"
      ],
      [
        "gg",
        "e"
      ],
      [
        "k",
        "ii"
      ],
      [
        "fg",
        "h"
      ],
      [
        "f",
        "ii"
      ],
      [
        "gg",
        "h"
      ],
      [
        "dc",
        "b"
      ],
      [
        "d",
        "bc"
      ],
      [
        "jj",
        "kk"
      ],
      [
        "d",
        "eee"
      ],
      [
        "f",
        "hi"
      ],
      [
        "fg",
        "i"
      ],
      [
        "dd",
        "g"
      ],
      [
        "bbbb",
        "bc"
      ],
      [
        "gg",
        "i"
      ],
      [
        "c",
        "g"
      ],
      [
        "cc",
        "b"
      ],
      [
        "ii",
        "ii"
      ],
      [
        "bbbbbbbb",
        "bb"
      ],
      [
        "de",
        "de"
      ],
      [
        "ji",
        "h"
      ],
      [
        "bc",
        "bc"
      ],
      [
        "hg",
        "e"
      ],
      [
        "hg",
        "h"
      ],
      [
        "bbbbbbbb",
        "bbb"
      ],
      [
        "ee",
        "g"
      ],
      [
        "ff",
        "gg"
      ],
      [
        "hi",
        "h"
      ],
      [
        "dd",
        "b"
      ],
      [
        "ff",
        "h"
      ],
      [
        "fe",
        "c"
      ],
      [
        "kkkk",
        "kk"
      ],
      [
        "e",
        "h"
      ],
      [
        "e",
        "i"
      ],
      [
        "bbbbbbbb",
        "b"
      ],
      [
        "ji",
        "g"
      ],
      [
        "de",
        "c"
      ],
      [
        "fe",
        "fe"
      ],
      [
        "f",
        "bb"
      ],
      [
        "k",
        "m"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbb"
      ],
      [
        "bbb",
        "cc"
      ],
      [
        "fee",
        "ee"
      ],
      [
        "e",
        "b"
      ],
      [
        "jk",
        "jj"
      ],
      [
        "c",
        "bb"
      ],
      [
        "1",
        "0"
      ],
      [
        "de",
        "g"
      ],
      [
        "ge",
        "g"
      ],
      [
        "ff",
        "i"
      ],
      [
        "j",
        "hg"
      ],
      [
        "dc",
        "d"
      ],
      [
        "j",
        "ll"
      ],
      [
        "fgg",
        "g"
      ],
      [
        "bbbb",
        "bbc"
      ],
      [
        "ff",
        "c"
      ],
      [
        "fd",
        "g"
      ],
      [
        "ji",
        "jj"
      ],
      [
        "n",
        "m"
      ],
      [
        "bc",
        "bb"
      ],
      [
        "d",
        "fg"
      ],
      [
        "j",
        "lk"
      ],
      [
        "ii",
        "h"
      ],
      [
        "ee",
        "c"
      ],
      [
        "bc",
        "e"
      ],
      [
        "d",
        "gg"
      ],
      [
        "f",
        "dddd"
      ],
      [
        "b",
        "cccc"
      ],
      [
        "j",
        "gi"
      ],
      [
        "jj",
        "h"
      ],
      [
        "k",
        "jkk"
      ],
      [
        "cc",
        "e"
      ],
      [
        "bbbb",
        "bbbc"
      ],
      [
        "d",
        "cccc"
      ],
      [
        "fd",
        "ee"
      ],
      [
        "j",
        "gg"
      ],
      [
        "bbc",
        "b"
      ],
      [
        "h",
        "c"
      ],
      [
        "jii",
        "i"
      ],
      [
        "f",
        "k"
      ],
      [
        "dc",
        "dc"
      ],
      [
        "f",
        "ccc"
      ],
      [
        "hg",
        "hh"
      ],
      [
        "fh",
        "e"
      ],
      [
        "fi",
        "g"
      ],
      [
        "dee",
        "ee"
      ],
      [
        "bb",
        "ccc"
      ],
      [
        "j",
        "m"
      ],
      [
        "l",
        "mm"
      ],
      [
        "f",
        "dde"
      ],
      [
        "ii",
        "g"
      ],
      [
        "fc",
        "e"
      ],
      [
        "fe",
        "ff"
      ],
      [
        "i",
        "e"
      ],
      [
        "gi",
        "g"
      ],
      [
        "kl",
        "kk"
      ],
      [
        "1",
        "1"
      ],
      [
        "l",
        "h"
      ],
      [
        "fe",
        "d"
      ],
      [
        "fg",
        "fg"
      ],
      [
        "dddd",
        "e"
      ],
      [
        "jj",
        "g"
      ],
      [
        "1",
        "2"
      ],
      [
        "cccccccccccccccccccccccccccccccc",
        "cccccccccccccccccccccccccccccccc"
      ],
      [
        "kk",
        "i"
      ],
      [
        "j",
        "gh"
      ],
      [
        "ji",
        "ji"
      ],
      [
        "hi",
        "hh"
      ],
      [
        "d",
        "ge"
      ],
      [
        "db",
        "e"
      ],
      [
        "d",
        "fc"
      ],
      [
        "f",
        "bc"
      ],
      [
        "j",
        "kkkk"
      ],
      [
        "fe",
        "h"
      ],
      [
        "bbb",
        "e"
      ],
      [
        "jjjj",
        "jjjj"
      ],
      [
        "fg",
        "ff"
      ],
      [
        "k",
        "e"
      ],
      [
        "ll",
        "kk"
      ],
      [
        "k",
        "jh"
      ],
      [
        "jj",
        "ii"
      ],
      [
        "kkkkkkkk",
        "kkkkkkkk"
      ],
      [
        "c",
        "bc"
      ],
      [
        "dd",
        "h"
      ],
      [
        "b",
        "ee"
      ],
      [
        "d",
        "fd"
      ],
      [
        "dd",
        "dee"
      ],
      [
        "jj",
        "ji"
      ],
      [
        "bb",
        "d"
      ],
      [
        "hh",
        "gg"
      ],
      [
        "fe",
        "de"
      ],
      [
        "gi",
        "h"
      ],
      [
        "g",
        "ee"
      ],
      [
        "fg",
        "ee"
      ],
      [
        "gh",
        "e"
      ],
      [
        "b",
        "dc"
      ],
      [
        "cccccccccccccccc",
        "cccccccc"
      ],
      [
        "hh",
        "e"
      ],
      [
        "eeee",
        "ee"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbbb"
      ],
      [
        "l",
        "jj"
      ],
      [
        "l",
        "jk"
      ],
      [
        "db",
        "cc"
      ],
      [
        "b",
        "cccccccc"
      ],
      [
        "dc",
        "dd"
      ],
      [
        "gh",
        "gg"
      ],
      [
        "k",
        "jjjj"
      ],
      [
        "fi",
        "h"
      ],
      [
        "d",
        "fee"
      ],
      [
        "l",
        "g"
      ],
      [
        "d",
        "bbb"
      ],
      [
        "cb",
        "cc"
      ],
      [
        "j",
        "f"
      ],
      [
        "fe",
        "dd"
      ],
      [
        "k",
        "hi"
      ],
      [
        "de",
        "dd"
      ],
      [
        "bbbbbbbbbbbb",
        "bb"
      ],
      [
        "c",
        "ee"
      ],
      [
        "f",
        "be"
      ],
      [
        "k",
        "hh"
      ],
      [
        "jk",
        "h"
      ],
      [
        "1",
        "5"
      ],
      [
        "ll",
        "lk"
      ],
      [
        "dc",
        "g"
      ],
      [
        "dddd",
        "dd"
      ],
      [
        "ll",
        "m"
      ],
      [
        "1",
        "3"
      ],
      [
        "b",
        "h"
      ],
      [
        "j",
        "c"
      ],
      [
        "d",
        "bbc"
      ],
      [
        "g",
        "ff"
      ],
      [
        "jh",
        "ii"
      ],
      [
        "mm",
        "mm"
      ],
      [
        "hh",
        "ii"
      ],
      [
        "hh",
        "hi"
      ],
      [
        "nnnn",
        "nnnn"
      ],
      [
        "l",
        "kkkk"
      ],
      [
        "lk",
        "i"
      ],
      [
        "b",
        "de"
      ],
      [
        "hg",
        "hg"
      ],
      [
        "bb",
        "g"
      ],
      [
        "bbbb",
        "cc"
      ],
      [
        "1",
        "4"
      ],
      [
        "jj",
        "jk"
      ],
      [
        "ccc",
        "b"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbb"
      ],
      [
        "c",
        "dd"
      ],
      [
        "ki",
        "h"
      ],
      [
        "ff",
        "ffe"
      ],
      [
        "dc",
        "de"
      ],
      [
        "fc",
        "b"
      ],
      [
        "ff",
        "eee"
      ],
      [
        "fe",
        "i"
      ],
      [
        "he",
        "g"
      ],
      [
        "c",
        "h"
      ],
      [
        "fee",
        "g"
      ],
      [
        "bbbbbbbbbbbb",
        "b"
      ],
      [
        "fh",
        "gg"
      ],
      [
        "dcc",
        "e"
      ],
      [
        "hgg",
        "g"
      ],
      [
        "bb",
        "cccc"
      ],
      [
        "fe",
        "b"
      ],
      [
        "f",
        "jj"
      ],
      [
        "fe",
        "fg"
      ],
      [
        "jk",
        "ji"
      ],
      [
        "hh",
        "hg"
      ],
      [
        "ff",
        "ge"
      ],
      [
        "ffe",
        "g"
      ],
      [
        "fd",
        "cc"
      ],
      [
        "1",
        "6"
      ],
      [
        "bbc",
        "bc"
      ],
      [
        "bbbbbbbbbbbb",
        "bbb"
      ],
      [
        "jl",
        "kk"
      ],
      [
        "c",
        "dc"
      ],
      [
        "de",
        "h"
      ],
      [
        "fgg",
        "gg"
      ],
      [
        "d",
        "bbbb"
      ],
      [
        "dd",
        "ccc"
      ],
      [
        "jl",
        "i"
      ],
      [
        "l",
        "j"
      ],
      [
        "ki",
        "g"
      ],
      [
        "cb",
        "e"
      ],
      [
        "mm",
        "m"
      ],
      [
        "c",
        "de"
      ],
      [
        "d",
        "j"
      ],
      [
        "k",
        "jii"
      ],
      [
        "dd",
        "dg"
      ],
      [
        "dd",
        "ce"
      ],
      [
        "cccccccc",
        "cccc"
      ],
      [
        "ee",
        "eee"
      ],
      [
        "hi",
        "hi"
      ],
      [
        "jk",
        "jk"
      ],
      [
        "fgg",
        "e"
      ],
      [
        "ff",
        "fee"
      ],
      [
        "f",
        "ji"
      ],
      [
        "de",
        "i"
      ],
      [
        "fg",
        "fe"
      ],
      [
        "jkk",
        "i"
      ],
      [
        "g",
        "b"
      ],
      [
        "dc",
        "bc"
      ],
      [
        "d",
        "gh"
      ],
      [
        "fe",
        "fee"
      ],
      [
        "ccc",
        "e"
      ],
      [
        "j",
        "ge"
      ],
      [
        "l",
        "ji"
      ],
      [
        "ff",
        "d"
      ],
      [
        "fg",
        "hg"
      ],
      [
        "ffff",
        "g"
      ],
      [
        "c",
        "bbb"
      ],
      [
        "b",
        "dd"
      ],
      [
        "f",
        "ddc"
      ],
      [
        "kjj",
        "i"
      ],
      [
        "f",
        "bbb"
      ],
      [
        "ee",
        "de"
      ],
      [
        "ff",
        "fh"
      ],
      [
        "jjjj",
        "i"
      ],
      [
        "k",
        "hg"
      ],
      [
        "k",
        "llll"
      ],
      [
        "kk",
        "jj"
      ],
      [
        "k",
        "jg"
      ],
      [
        "ji",
        "hh"
      ],
      [
        "jk",
        "ii"
      ],
      [
        "eee",
        "g"
      ],
      [
        "h",
        "d"
      ],
      [
        "bbbb",
        "be"
      ],
      [
        "fg",
        "hh"
      ],
      [
        "f",
        "jh"
      ],
      [
        "f",
        "ddd"
      ],
      [
        "fi",
        "e"
      ],
      [
        "k",
        "gg"
      ],
      [
        "de",
        "dc"
      ],
      [
        "de",
        "dee"
      ],
      [
        "dddd",
        "c"
      ],
      [
        "kl",
        "i"
      ],
      [
        "llllllll",
        "llllllll"
      ],
      [
        "ff",
        "fgg"
      ],
      [
        "fe",
        "ge"
      ],
      [
        "bc",
        "bcc"
      ],
      [
        "eeee",
        "eeee"
      ],
      [
        "j",
        "d"
      ],
      [
        "bc",
        "bbc"
      ],
      [
        "fc",
        "g"
      ],
      [
        "dcc",
        "b"
      ],
      [
        "cc",
        "g"
      ],
      [
        "bbbbbbbb",
        "c"
      ],
      [
        "cccc",
        "b"
      ],
      [
        "fe",
        "gg"
      ],
      [
        "fg",
        "c"
      ],
      [
        "ffff",
        "ffff"
      ],
      [
        "cccccccc",
        "cc"
      ],
      [
        "bc",
        "bbb"
      ],
      [
        "f",
        "jg"
      ],
      [
        "l",
        "n"
      ],
      [
        "ih",
        "ii"
      ],
      [
        "1",
        "8"
      ],
      [
        "h",
        "ee"
      ],
      [
        "dd",
        "i"
      ],
      [
        "dd",
        "eee"
      ],
      [
        "gi",
        "e"
      ],
      [
        "g",
        "f"
      ],
      [
        "de",
        "fe"
      ],
      [
        "hi",
        "e"
      ],
      [
        "dc",
        "bb"
      ],
      [
        "fee",
        "eee"
      ],
      [
        "kk",
        "h"
      ],
      [
        "b",
        "i"
      ],
      [
        "cccccccc",
        "ccc"
      ],
      [
        "d",
        "hg"
      ],
      [
        "dd",
        "cb"
      ],
      [
        "bbbb",
        "e"
      ],
      [
        "bbbb",
        "bcc"
      ],
      [
        "dc",
        "dddd"
      ],
      [
        "nn",
        "m"
      ],
      [
        "df",
        "de"
      ],
      [
        "c",
        "i"
      ],
      [
        "dd",
        "dcc"
      ],
      [
        "d",
        "hh"
      ],
      [
        "gg",
        "fg"
      ],
      [
        "ji",
        "hi"
      ],
      [
        "ff",
        "cc"
      ],
      [
        "jj",
        "ki"
      ],
      [
        "fd",
        "b"
      ],
      [
        "f",
        "jk"
      ],
      [
        "ff",
        "de"
      ],
      [
        "jj",
        "j"
      ],
      [
        "de",
        "dddd"
      ],
      [
        "b",
        "f"
      ],
      [
        "d",
        "ffe"
      ],
      [
        "cc",
        "bb"
      ],
      [
        "dd",
        "fe"
      ],
      [
        "bbbbbbbb",
        "bc"
      ],
      [
        "gg",
        "hh"
      ],
      [
        "fd",
        "h"
      ],
      [
        "d",
        "fh"
      ],
      [
        "hg",
        "ii"
      ],
      [
        "bbb",
        "ccc"
      ],
      [
        "f",
        "l"
      ],
      [
        "f",
        "kk"
      ],
      [
        "jj",
        "ih"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbb"
      ],
      [
        "jk",
        "l"
      ],
      [
        "nn",
        "n"
      ],
      [
        "1",
        "7"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "h",
        "b"
      ],
      [
        "bbbbbbbb",
        "bbbc"
      ],
      [
        "hg",
        "hi"
      ],
      [
        "f",
        "cccc"
      ],
      [
        "ff",
        "b"
      ],
      [
        "bbc",
        "bb"
      ],
      [
        "dee",
        "eee"
      ],
      [
        "hgg",
        "gg"
      ],
      [
        "d",
        "ccccc"
      ],
      [
        "j",
        "fg"
      ],
      [
        "ee",
        "i"
      ],
      [
        "ii",
        "hi"
      ],
      [
        "dde",
        "g"
      ],
      [
        "kl",
        "m"
      ],
      [
        "2",
        "3"
      ],
      [
        "d",
        "fi"
      ],
      [
        "g",
        "d"
      ],
      [
        "ee",
        "h"
      ],
      [
        "ji",
        "kk"
      ],
      [
        "lk",
        "lk"
      ],
      [
        "jh",
        "e"
      ],
      [
        "fgg",
        "h"
      ],
      [
        "2",
        "1"
      ],
      [
        "ff",
        "gh"
      ],
      [
        "dc",
        "ee"
      ],
      [
        "bbc",
        "e"
      ],
      [
        "f",
        "hhg"
      ],
      [
        "k",
        "jl"
      ],
      [
        "cc",
        "bc"
      ],
      [
        "ii",
        "ji"
      ],
      [
        "jk",
        "g"
      ],
      [
        "ge",
        "i"
      ],
      [
        "d",
        "he"
      ],
      [
        "dd",
        "db"
      ],
      [
        "bbbbbbbb",
        "bbc"
      ],
      [
        "cccccccc",
        "c"
      ],
      [
        "ll",
        "i"
      ],
      [
        "fd",
        "fe"
      ],
      [
        "llll",
        "ll"
      ],
      [
        "jii",
        "g"
      ],
      [
        "kjj",
        "kk"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbb"
      ],
      [
        "de",
        "dde"
      ],
      [
        "dc",
        "dcc"
      ],
      [
        "l",
        "ii"
      ],
      [
        "hh",
        "gh"
      ],
      [
        "k",
        "gi"
      ],
      [
        "cccc",
        "cb"
      ],
      [
        "ff",
        "hg"
      ],
      [
        "hh",
        "ih"
      ],
      [
        "ii",
        "jj"
      ],
      [
        "cccccccc",
        "ccccccc"
      ],
      [
        "ge",
        "c"
      ],
      [
        "bbbc",
        "b"
      ],
      [
        "d",
        "gi"
      ],
      [
        "h",
        "jj"
      ],
      [
        "i",
        "j"
      ],
      [
        "l",
        "jkk"
      ],
      [
        "ff",
        "fd"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbb"
      ],
      [
        "de",
        "cc"
      ],
      [
        "dc",
        "ddc"
      ],
      [
        "dddd",
        "dde"
      ],
      [
        "jk",
        "jkk"
      ],
      [
        "bbc",
        "bbc"
      ],
      [
        "jjjj",
        "jj"
      ],
      [
        "bcc",
        "b"
      ],
      [
        "e",
        "f"
      ],
      [
        "k",
        "gh"
      ],
      [
        "fe",
        "cc"
      ],
      [
        "bc",
        "g"
      ],
      [
        "jh",
        "gg"
      ],
      [
        "ee",
        "b"
      ],
      [
        "kk",
        "ki"
      ],
      [
        "hg",
        "fg"
      ],
      [
        "fgg",
        "i"
      ],
      [
        "jii",
        "ii"
      ],
      [
        "ce",
        "g"
      ],
      [
        "eeee",
        "eee"
      ],
      [
        "bbcc",
        "b"
      ],
      [
        "l",
        "e"
      ],
      [
        "ff",
        "hh"
      ],
      [
        "fe",
        "ffe"
      ],
      [
        "he",
        "i"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "dd",
        "bb"
      ],
      [
        "dd",
        "bc"
      ],
      [
        "fg",
        "fh"
      ],
      [
        "ge",
        "h"
      ],
      [
        "hgg",
        "i"
      ],
      [
        "bcb",
        "ccc"
      ],
      [
        "h",
        "k"
      ],
      [
        "m",
        "i"
      ],
      [
        "fe",
        "dee"
      ],
      [
        "cccccccc",
        "ccccc"
      ],
      [
        "hi",
        "ji"
      ],
      [
        "jh",
        "ji"
      ],
      [
        "kkkkkkkk",
        "kk"
      ],
      [
        "kjk",
        "i"
      ],
      [
        "2",
        "2"
      ],
      [
        "c",
        "bbbb"
      ],
      [
        "dc",
        "db"
      ],
      [
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb",
        "bbbbbbbbbbbbbbbbbbbbbbbbbbbb"
      ],
      [
        "hg",
        "ff"
      ],
      [
        "hi",
        "jj"
      ],
      [
        "be",
        "g"
      ],
      [
        "hhh",
        "ii"
      ],
      [
        "f",
        "hhi"
      ],
      [
        "bbbb",
        "cb"
      ],
      [
        "ff",
        "dd"
      ],
      [
        "ff",
        "fc"
      ],
      [
        "hh",
        "gi"
      ],
      [
        "ge",
        "de"
      ],
      [
        "b",
        "db"
      ],
      [
        "k",
        "n"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bb"
      ],
      [
        "bbb",
        "d"
      ],
      [
        "bbb",
        "g"
      ],
      [
        "dddd",
        "de"
      ],
      [
        "jk",
        "ll"
      ],
      [
        "be",
        "c"
      ],
      [
        "j",
        "ee"
      ],
      [
        "j",
        "fh"
      ],
      [
        "m",
        "ll"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "b"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbb"
      ],
      [
        "hi",
        "hg"
      ],
      [
        "jk",
        "lk"
      ],
      [
        "fd",
        "i"
      ],
      [
        "bbbc",
        "bb"
      ],
      [
        "f",
        "bbbb"
      ],
      [
        "f",
        "bd"
      ],
      [
        "h",
        "ff"
      ],
      [
        "j",
        "hhi"
      ],
      [
        "k",
        "iii"
      ],
      [
        "bb",
        "ee"
      ],
      [
        "dd",
        "fg"
      ],
      [
        "jj",
        "jii"
      ],
      [
        "bbbbbbbbbbbbbbbb",
        "bbbbbbb"
      ],
      [
        "bc",
        "d"
      ],
      [
        "ji",
        "e"
      ],
      [
        "fd",
        "eee"
      ],
      [
        "lk",
        "ll"
      ],
      [
        "dg",
        "ee"
      ],
      [
        "b",
        "fe"
      ],
      [
        "c",
        "gg"
      ],
      [
        "dc",
        "bcc"
      ],
      [
        "kl",
        "kkkk"
      ],
      [
        "kj",
        "kkkk"
      ],
      [
        "m",
        "n"
      ],
      [
        "jj",
        "jkk"
      ],
      [
        "hi",
        "gi"
      ],
      [
        "bbb",
        "cccc"
      ],
      [
        "ccc",
        "bc"
      ],
      [
        "fc",
        "bb"
